{
    "filename": "Beneficialeffectsofgreentea.Areview.pdf",
    "type": "pdf",
    "title": "",
    "authors": "",
    "lastmodifiedtime": "D:20060323172315Z",
    "text": "See discussions, st ats, and author pr ofiles f or this public ation at : https://www .researchgate.ne t/public ation/7197884\nBeneﬁcial Effects of Green Tea—A Review\nArticle    in  Journal of the Americ an Colle ge of Nutrition  · May 2006\nDOI: 10.1080/07315724.2006.10719518  · Sour ce: PubMed\nCITATIONS\n1,888READS\n18,107\n3 author s, including:\nCarmen Cabr era\nUniv ersity of Mur cia\n46 PUBLICA TIONS    3,966  CITATIONS    \nSEE PROFILE\nReyes Art acho\nUniv ersity of Gr anada\n105 PUBLICA TIONS    3,721  CITATIONS    \nSEE PROFILE\nAll c ontent f ollo wing this p age was uplo aded b y Reyes Art acho  on 28 June 2018.\nThe user has r equest ed enhanc ement of the do wnlo aded file.Review\nBeneficial Effects of Green Tea—A Review\nCarmen Cabrera, PhD, Reyes Artacho, PhD, Rafael Gime ´nez, PhD\nDepartamento de Nutricio ´n y Bromatologı ´a, Facultad de Farmacia, Universidad de Granada, Granada, SPAIN\nKey words: green tea, polyphenols, catechins, antioxidant activity, human health\nTea is the most consumed drink in the world after water. Green tea is a ‘non-fermented’ tea, and contains\nmore catechins, than black tea or oolong tea. Catechins are in vitro andin vivo strong antioxidants. In addition,\nits content of certain minerals and vitamins increases the antioxidant potential of this type of tea. Since ancienttimes, green tea has been considered by the traditional Chinese medicine as a healthful beverage. Recent humanstudies suggest that green tea may contribute to a reduction in the risk of cardiovascular disease and some formsof cancer, as well as to the promotion of oral health and other physiological functions such as anti-hypertensiveeffect, body weight control, antibacterial and antivirasic activity, solar ultraviolet protection, bone mineraldensity increase, anti-fibrotic properties, and neuroprotective power. Increasing interest in its health benefits hasled to the inclusion of green tea in the group of beverages with functional properties. However, although all theevidence from research on green tea is very promising, future studies are necessary to fully understand itscontributions to human health, and advise its regular consumption in Western diets, in which green teaconsumption is nowadays limited and sporadic.\nKey teaching points:\n\u007f Green tea contains numerous components with antioxidant activity: polyphenols (especially catechins), minerals, vitamins.\u007f Green tea contains more catechins than black or oolong teas.\u007f The strong antioxidant potential of catechins, and especially EGCG, are widely demonstrated in vitro and in animal studies. In\naddition, catechins possess antimutagenic, antidiabetic, anti-inflammatory, antibacterial and antiviral properties.\n\u007f Recent human studies suggest that green tea may contribute to reduce the risk of cardiovascular disease and cancer, and has another\nbeneficial effect on health.\n\u007f Although research of green tea is very promising, future studies considering dietetic, environmental and life style factors, are\nnecessary to fully understand its contribution to human health.\nINTRODUCTION\nTea, a product made up from leaf and bud of the plant\nCamellia sinensis , is the second most consumed beverage in the\nworld, well ahead of coffee, beer, wine and carbonated softdrinks [1–2]. Originating from China, tea has gained theworld’s taste in the past 2000 years. The economic and socialinterest of tea is clear and its consumption is part of manypeople daily routine, as an everyday drink and as a therapeuticaid in many illnesses.Depending on the manufacturing process, teas are classified\ninto three major types: ‘non-fermented’ green tea (produced bydrying and steaming the fresh leaves to inactivate the polyphe-nol oxidase and thus, non oxidation occurs); ‘semi-fermented’\noolong tea (produced when the fresh leaves are subjected to apartial fermentation stage before drying); and ‘fermented’black and red ( Pu-Erh ) teas which undergo a post-harvest\nfermentation stage before drying and steaming, although thefermentation of black tea is due to an oxidation catalyzed bypolyphenol oxidase, and that of Pu-Erh tea is attained by using\nAddress reprint requests to: Carmen Cabrera, PhD, Dpto. Nutricio ´n y Bromatologı ´a, Facultad de Farmacia, Campus Universitario de Cartuja, 18012-Granada, SPAIN.\nE-mail: carmenc@ugr.es.\nAbbreviations: CI /H11005confidence interval, DNA /H11005deoxyribonucleic acid, DPPH /H110052,2-diphenyl-l-picrylhydrazyl assay, DMPD /H11005N,N-dimethyl-p-phenylendiamine assay,\nEC/H11005(/H11002)-epicatechin, ECG /H11005(/H11002)-epicatechin-3-gallate, EGC /H11005(/H11002)-epigallocatechin, EGCG /H11005(/H11002)-epigallocatechin-3-gallate, FRAP /H11005ferric reducing ability of\nplasma assay, GA /H11005gallic acid, GTP /H11005green tea polyphenols, HDL /H11005high density lipoproteins, HR /H11005hazard ratio, LDL /H11005low density lipoproteins, OR /H11005odd ratio,\nORAC/H11005oxygen radical absorbance capacity assay, PCL /H11005photochemiluminescence assay, RR /H11005relative risk, TEAC /H11005Trolox equivalent antioxidant capacity assay,\nTRAP/H11005total radical-trapping antioxidant parameter assay, UV /H11005ultraviolet.\nJournal of the American College of Nutrition, Vol. 25, No. 2, 79–99 (2006)\nPublished by the American College of Nutrition\n79microorganisms [3–4]. McKay and Blumberg [4] reported a\nper capita mean consumption of tea in the world of 120 mL/day. Approximately 76–78% of the tea produced and con-sumed is black tea, 20–22% is green tea and less than 2% isoolong tea [5]. Black tea is consumed principally in Europe,North America and North Africa (except Morocco) while greentea is widely drunk in China, Japan, Korea and Morocco;oolong tea is popular in China and Taiwan [5–6]. In USA, the80% of tea consumed is black ice tea [7].\nAlthough health benefits have been attributed to green tea\nconsumption since the beginning of its history, scientific in-vestigations on this beverage and its constituents have beenunderway for less than three decades [4]. In vitro and animal\nstudies, and clinical trials employing putative intermediaryindicators of disease, particularly biomarkers of oxidative stressstatus, provide strong evidence that green tea polyphenols(GTP) may play a role in the risk and pathogenesis of severalchronic diseases, especially cardiovascular disease and cancer,and related pathologies. In addition, several studies suggest abeneficial impact of green tea intake on bone density, cognitivefunction, dental caries and kidney stones, among other effects[4–5]. Over the last years, numerous epidemiological and clin-ical studies have revealed several physiological responses togreen tea which may be relevant to the promotion of health andthe prevention or treatment of some chronic diseases. However,the results from epidemiological and clinical studies of therelationship between green tea consumption and human healthare mixed. For example, conflicting results between humanstudies may arise in part, from ignoring socioeconomic andlifestyle factors as well as by inadequate methodology to definetea preparation and intake [2,4–7].\nFoodstuff can be regarded as functional if it is satisfactorily\ndemonstrated to affect beneficially one or more target functionsin the body, beyond adequate nutritional effects in a way whichis relevant to either the state of well-being and health or thereduction of the risk of a disease [5,8–9], so green tea has beenproved to have functional properties and at present, its con-sumption is widely recommended.\nThe aim of this article is to revise the most recent studies on\ngreen tea beneficial effects and to evaluate its potential interestin Western diets.\nGreen Tea Processing\nGreen tea is mainly produced from Camellia sinensis var.\nsinensis . The Assan type ( Camellia sinensis var.assamica ) has\na too high content of polyphenols, which would make green teataste excessively bitter [3]. The production of green tea ischaracterized by an initial heating process, which kills theenzyme polyphenol oxidase, which is responsible for the con-version of the flavanols in the leaf into the dark polyphenoliccompounds that colour black tea. The other important processis rolling, in which leaves are cut and twisted. The final form ofgreen tea depends on the particular variant being produced. Therolling stage is very similar to the operation with the same\nname in black tea production. Green tea production is restrictedmainly to China and Japan [3,6]. Fig. 1 shows the principaldifferences between green and black tea processing.\nGreen Tea Composition\nGreen tea chemical composition is complex: proteins (15–\n20% dry weight) whose enzymes constitute an important frac-tion; aminoacids (1–4% dry weight) such as teanine or 5- N-\nethylglutamine, glutamic acid, tryptophan, glycine, serine,aspartic acid, tyrosine, valine, leucine, threonine, arginine, ly-sine; carbohydrates (5–7% dry weight) such as cellulose, pec-tins, glucose, fructose, sucrose; lipids as linoleic and\n/H9251-linole-\nnic acids; sterols as stigmasterol; vitamins (B, C, E); xanthicbases such as caffeine and theophylline (Fig. 2); pigments aschlorophyll and carotenoids; volatile compounds as aldehydes,alcohols, esters, lactones, hydrocarbons, etc.; minerals andtrace elements (5% dry weight) such as Ca, Mg, Cr, Mn, Fe,Cu, Zn, Mo, Se, Na, P, Co, Sr, Ni, K, F and Al. Due to the greatimportance of the mineral presence in tea, many studies havebeen carried out to determine their levels in green tea leavesand their infusions. For example, Costa et al. [1] observed large\nvariations of the mineral content (Al, Ca, Mg and Mn) in greentea from different origins. Ferna ´ndez-Ca ´ceres et al. [10] deter-\nmined the content of Al, Ba, Ca, Cu, Fe, K, Mg, Mn, Na, Sr, Ti,and Zn in 46 tea samples, and no clear differences were foundbetween mineral content of green and black teas. Shu et al. [11]\nobserved the great variations among different tea varieties inaccumulating fluoride and aluminum. Fung et al. [12] indicated\nthat black tea had higher Al and F concentrations than greentea. Xu et al. [13] reported that the content of Se in green teas\nwas greatly increased by foliar application of Se-enriched fer-tilizers; moreover, the selenium-enriched green tea exhibitedsignificantly higher antioxidant activity than regular green tea.Table 1 summarizes the mean chemical composition of greentea leaves in comparison with black tea leaves and its infusion.\nPolyphenols constitute the most interesting group of green\ntea leaf components, and in consequence, green tea can beconsidered an important dietary source of polyphenols, partic-ularly flavonoids. Flavonoids are phenol derivatives synthe-sized in substantial amounts (0.5–1.5%) and variety (more than4000 identified), and widely distributed among plants [14]. TheUnited States Department of Agriculture (USDA) has recentlypublished a Database for the Flavonoid Content of SelectedFoods [15]. The main flavonoids present in green tea includecatechins (flavan-3-ols). The four major catechins are ( /H11002)-\nepigallocatechin-3-gallate (EGCG), that represents approxi-mately 59% of the total of catechins; ( /H11002)-epigallocatechin\n(EGC) (19% approximately); ( /H11002)-epicatechin-3-gallate (ECG)\n(13.6% approximately); and ( /H11002)-epicatechin (EC) (6.4% ap-\nproximately) [4]. Green tea also contains gallic acid (GA) andother phenolic acids such as chlorogenic acid and caffeic acid,and flavonols such as kaempferol, myricetin and quercetin [15].Green Tea: Beneficial Effects\n80 VOL. 25, NO. 2Fig. 3 shows the chemical structure of GA and the four\nmajor catechins present in green tea. In black tea the poly-merized catechins such as theaflavins and thearubigins pre-dominate. Black and green teas both contain similar amount\nof flavonoids, however they differ in their chemical struc-ture; green tea contains more catechins (simple flavonoids),while the oxidation undergone by the leaves in order to makeblack tea, converts these simple flavonoids into theaflavinsand thearubigins [15].\nThe relative catechin content of green tea depends on how\nthe leaves are processed before drying (a certain grade offermentation and heating of tea leaves during the manufactur-ing process can result in polymerization of monopolyphenoliccompounds such as the catechins, leading to conformationalchanges and thus modifying its properties. Other factors influ-\nencing catechin content are the geographical location andgrowing conditions (soil, climate, agricultural practices, fertil-izers), the type of green tea (e.g., blended, decaffeinated, in-stant, . . .), and the preparation of the infusion (e.g., amount ofthe product used, brew time, temperature) [5,16]. McKay andBlumberg [5] reported that decaffeinating reduces slightly the\nFig. 1. Principal differences between green and black tea processing and its influence on the final polyphenols content.\nFig. 2. Chemical structure of caffeine and theophylline.Table 1. Mean Composition (%) of Green Tea and Black\nTea (and Its Infusion). From Belitz and Grosh [167]\nCompound Green tea* Black tea* Infusion†\nProteins 15 15 trace\nAminoacids 4 4 3.5Fibre 26 26 0Others carbohydrates 7 7 4Lipids 7 7 tracePigments 2 2 traceMinerals 5 5 4.5Phenolic compounds\n‡30 5 4.5\nOxidised phenolic compounds§0 25 4.5\n* Data refereed to dry weight of tea leaves.\n†Black tea; infusion time: 3 min.\n‡Especially flavonoids.\n§Especially thearubigins and theaflavins.Green Tea: Beneficial Effects\nJOURNAL OF THE AMERICAN COLLEGE OF NUTRITION 81tea catechin content; also, instant preparations and iced and\nready-to drink teas present less content of catequins [16–17].The production of bottled green tea beverage has encountereda browning problem mainly caused by the oxidation of cat-echins [18].\nWu and Wei [5] indicated that a cup of green tea (2.5 g of\ngreen tea leaves/200 mL of water) may contain 90 mg ofEGCG. Lin et al. [19] analyzed 31 commercial teas, and\ndetected that the levels of EGCG and total catechins were in thefollowing order: green tea (old leaves) /H11022green tea (young\nleaves) and oolong tea /H11022black tea and Pu-Erh tea. Ferna ´ndez\net al. [20] determined the contents of GA, EGCG, EGC, EC\nand ECG, in a set of 45 tea samples, including black and greenteas from different geographical origins (i.e. China, Japan,Kenya, Sri Lanka, and India); the GA levels were alwayshigher in black tea because the amount of GA increases duringthe fermentation process due to its liberation from catechingallates [21]. The amount of catechins were always higher ingreen tea; EGCG and EGC were the major catechins presentwith average contents of 7.358% and 3.955%, respectively;ECG presented values ranging between 0.910 and 3.556%. Forblack tea, EGCG and ECG were the catechins present in higherpercentages, with average contents of 1.583 and 0.706%, re-spectively. Cabrera et al. [22] reported the mean content of the\nfour major catechins (EGCG, EGC, ECG and EC) and gallicacid in 45 samples of different types of tea including black, red,oolong and green teas; the higher levels of EGCG appeared ingreen tea samples. Results are summarized in Fig. 4. However,Henning et al. [23] suggested that the large variation of the\ncatechin content in tea is not taken into consideration in most ofthe epidemiological studies.Bioavailability of Green Tea Catechins\nThe potential health effects of catechins depend not only on\nthe amount consumed but on their bioavailability which ap-pears to be very variable. In order to know the catechin bio-availability and metabolism, it is necessary to evaluate theirbiological activity within target tissues [24]. Following oraladministration of tea catechins to rats, the four principal cat-echins (EC, ECG, EGC, and EGCG) have been identified in theportal vein, indicating that tea catechins are absorbed intesti-nally [25]. In rats given 0.6% GTP in their drinking water overa period of 28 days, plasma concentrations of EGCG weremuch lower than those of EGC or EC, even though the ratio ofEGCG to EGC was 5:1 in the GTP solution. When the sameGTP preparation was given to mice, plasma levels of EGCGwere much higher than those of EGC and EC. So, there appearto be species differences in the bioavailability of EGCG com-pared to the other catechins [26]. In humans, EGCG may beless bioavailable than other green tea catechins. Catechin levelsin human plasma reach their peak 2 to 4 h after ingestion [27].A recent study in humans compared the pharmacokinetics ofequimolar doses of pure EGC, ECG, and EGCG in 10 healthyvolunteers; average peak plasma concentrations after a singledose of 1.5 mmol were 5.0\n/H9262mol/L for EGC, 3.1 /H9262mol/L for\nECG, and 1.3 /H9262mol/L for EGCG. After 24 h, plasma EGC and\nEGCG returned to baseline, but plasma ECG remained elevated[28]. In humans, ECG has been found to be more highlymethylated than EGC and EGCG, and EGCG has been found tobe less conjugated than EGC and EC [29]. Unfortunately, littlepublished data are available on tissue distribution of catechinsin humans after green tea consumption; however, there are\nsome interesting data from studies with animals. Kim et al. [26]\nFig. 3. Chemical structure of gallic acid and the four major catechins in green tea. GA, gallic acid; EGCG, ( /H11002)-epigallocatechin-3-gallate; EGC,\n(/H11002)-epigallocatechin; ECG, ( /H11002)-epicatechin-3-gallate; EC, ( /H11002)-epicatechin.Green Tea: Beneficial Effects\n82 VOL. 25, NO. 2observed that when rats were given 0.6% GTP in their drinking\nwater over a period of 28 days, substantial amounts of EGC andEC were found in the esophagus, large intestine, kidney, blad-der, lung, and prostate; EGC and EC concentrations wererelatively low in liver, spleen, heart, and thyroid; EGCG levelswere higher in the esophagus and large intestine, but lower inother organs, likely due to poor systemic absorption of EGCG.Catechins are rapidly and extensively metabolized; studies inrats indicated that EGCG is mainly excreted through the bile,while EGC and EC are excreted through urine and bile. Deter-mination of the actual bioavailability of metabolites in tissuesmay be much more important than knowledge of their plasmaconcentration, but data are still very scarce even in animals.Consequently, the metabolism and bioavailability of individualtea catechins and the pharmacokinetics of their metabolitesrequire further clarification.\nLuet al. [30] reported that GTP have biological activities\nincluding modulation of key signal transduction pathways;however, the possible significance of these activities in inhibi-tion of carcinogenesis in vivo depends on the polyphenol bio-\navailability. These authors observed that after oral administra-tion of green tea to rats, about 14% of EGC, 31% of EC, and/H110211% of EGCG appeared in the blood; in mice, the bioavail-\nability of EGCG was higher, but the biological activities of thecatechin metabolites still need to be investigated. Inter-individ-ual variations in the bioavailability of GTP can be substantialand may be due, in part, to differences in colonic microfloraand genetic polymorphisms among the enzymes involved inpolyphenol metabolism [31]. The effect of green tea drinking\nmay also differ by genotype [32]. To sum up, there appear to bespecies differences in the bioavailability of EGCG compared toother tea catechins. Further research results are largely consis-tent in demonstrating that the addition of milk to tea does notinterfere with catechin absorption [33–35], but milk may affectthe antioxidant potential of tea, depending upon milk fat con-tent, milk volume added, and the method used to assess thisparameter [33–36]. Xu et al. [37] observed that the epimerisa-\ntion reaction occurring in manufacturing canned and bottled teadrinks would not significantly affect antioxidant activity andbioavailability of total tea polyphenols.\nGreen Tea and Human Health\nGreen tea has been considered a medicine and a healthful\nbeverage since ancient times. The traditional Chinese medicinehas recommended this plant for headaches, body aches andpains, digestion, depression, detoxification, as an energizer and,in general, to prolong life. Green tea leaves contain three maincomponents which act upon human health: xanthic bases (caf-feine and theophylline), essential oils and especially, polyphe-nolic compounds. Caffeine acts mainly upon the central ner-vous system, stimulating wakefulness, facilitating ideasassociation and decreasing the sensation of fatigue [38]. Someof the effects caused by caffeine are influenced by theophyllinetea content. Theophylline induces psychoactive activity, it alsohas a slightly inotrope and vasodilator effect, and a much\nFig. 4. Mean content of gallic acid and catechins in different types of tea (n /H1100545). Data refereed to dry weight of commercial samples (Source:\nCabrera et al. [22]).Green Tea: Beneficial Effects\nJOURNAL OF THE AMERICAN COLLEGE OF NUTRITION 83higher diuretic effect than caffeine. However, its most interest-\ning effects can be seen at the bronchopulmonar and respiratorylevel. Theophylline causes a non-specific relaxation on thebronchial smooth muscle, and respiratory stimulation is alsoobserved. Essential oils are in a great extent volatile and theyevaporate from the beverage after some time, thus it is not veryconvenient to overextend the brewing time. Among their prop-erties, the one of facilitating digestion must be highlighted[5,39]. Green tea is the type of tea with the higher percentageof essential oils [38–39]. However, green tea has received agreat deal of attention especially due to its content of polyphe-nols, which are strong antioxidants and present important bio-logical properties. Numerous studies have also demonstratedthat the aqueous extract of GTP possesses antimutagenic, an-tidiabetic, antibacterial, anti-inflammatory, and hypocholester-olemic properties [21,40–44]. Beneficial effects in oral dis-eases such as protection against dental caries, periodontal\ndisease, and tooth loss (which may significantly affect a per-son’s overall health) have been also described [5]. Among allGTP, catechins and gallic acid have been especially consideredto be the main players in the beneficial effects on human healthnext detailed.\nAntioxidant Activity. Green tea is considered a dietary\nsource of antioxidant nutrients: green tea is rich in polyphenols(catechins and gallic acid, particularly), but it also containscarotenoids, tocopherols, ascorbic acid (vitamin C), mineralssuch as Cr, Mn, Se or Zn, and certain phytochemical com-pounds. These compounds could increase the GTP antioxidantpotential. GTP present antioxidant activity in vitro by scaveng-\ning reactive oxygen and nitrogen species and chelating redox-active transition metal ions; GTP can chelate metal ions likeiron and copper to prevent their participation in Fenton andHaber-Weiss reactions [4,45–46]. They may also function in-directly as antioxidants through 1) inhibition of the redox-sensitive transcription factors; 2) inhibition of ‘pro-oxidant’enzymes, such as inducible nitric oxide synthase, lipoxygen-ases, cyclooxygenases and xanthine oxidase; and 3) inductionof antioxidant enzymes, such as glutathione-S-transferases andsuperoxide dismutases.\nThe antioxidant capacity of GTP has been assessed by\nseveral methods. For example, Cao et al. [47] using the oxygen\nradical absorbance capacity (ORAC) assay found that green teahas a much higher antioxidant activity against peroxyl radicalsthan vegetables such as garlic, kale, spinach and Brusselssprouts. Using the ferric reducing ability of plasma (FRAP)assay. Langley-Evans [48] found that the total antioxidantcapacity of green tea is more potent than that of black tea.Saffari and Sadrzadeh [49] investigated the antioxidant capac-ity of EGCG using erythrocyte membrane-bound. ATPases asa model, and the results indicated that EGCG is a powerfulantioxidant that is capable of protecting erythrocyte membrane-bound ATPases against oxidative stress. Several studies haveshown that EGCG can act in vitro as an antioxidant by trappingproxyl radicals and inhibiting lipid peroxidation [49–50]. How-\never, the antioxidant capacity of catechins determined in vitro\nis dependent upon the type of assay employed and it does notreflect factors such as bioavailability and metabolism. The factthat catechins are rapidly and extensively metabolized empha-sizes the importance of demonstrating their antioxidant activityin vivo to better represent the physiological impact of green tea\nconsumption. Frei and Higdon [51] reported that in order todetermine whether or not GTP act as effective antioxidants in\nvivo, future studies in animals and humans should employ\nsensitive and specific biomarkers of oxidative damage of lipids,proteins and DNA.\nNevertheless, a substantial number of human intervention\nstudies with green tea demonstrate a significant increase inplasma antioxidant capacity in humans after consumption ofmoderate amounts (1–6 cups/day); there are also initial indica-tions which show that the enhanced blood antioxidant potentialleads to a reduced oxidative damage in macromolecules such asDNA and lipids [2,4,23,28,37]. However, these authors indi-cated that the measurement of oxidative damage through bi-omarkers needs to be further established. McKay and Blumberg[4] reported that the repeated consumption of green tea andencapsulated green tea extracts for one to four weeks has beendemonstrated to decrease biomarkers of oxidative status. Fur-thermore, Klaunig et al. [52] observed in a study with 40 male\nsmokers in China and 27 men and women (smokers and non-smokers) in the United States, that oxidative DNA damage,lipid peroxidation, and free radical generation were reducedafter consuming /H110116 cups/day of green tea for seven days.\nTherefore, GTP may contribute to defenses against oxidativedamages [5]. Erba et al. [53] suggest the ability of green tea,\nconsumed within a balanced controlled diet, to improve overallthe antioxidative status and to protect against oxidative damagein humans.\nAntimutagenic and Anticarcinogenic Potential. Life-\nstyle-related diseases, including cancer, are also characterizedas aging-related diseases, where aging may be the most potentcausal factor. Therefore, prevention of lifestyle-related diseaseswill depend on slowing the aging process and avoiding theclinical appearance the disease. Dietary components that arecapable of retarding cellular aging and inhibiting the growth ofcancer cells without affecting the growth of normal cells arereceiving considerable attention for the development of novelcancer-preventive approaches [54–56]. The role of green tea inprotection against cancer has been supported by ample evi-dence from studies in cell culture and animal models [54].Animal studies have shown that green tea inhibit carcinogen-esis of the skin, lung, oral cavity, esophagus, stomach, liver,kidney, prostate and other organs [55,57–60]. In some studies,the inhibition correlated with an increase in tumor cell apopto-sis and a decrease in cell proliferation [56]. Today, green tea isaccepted as a cancer preventive on the basis of numerous in\nvitro ,in vivo and epidemiological studies. The Chemopreven-\ntion Branch of the National Cancer Institute has initiated a plan\nGreen Tea: Beneficial Effects\n84 VOL. 25, NO. 2for developing tea compounds as cancer-chemopreventive\nagents in human trials [61]. The chemopreventive effects ofgreen tea depend on: (1) its antioxidant action; (2) the specificinduction of detoxifying enzymes; (3) its molecular regulatoryfunctions on cellular growth, development and apoptosis; and(4) a selective improvement in the function of the intestinalbacteria flora. D’Alessandro et al. [62] also indicated that an\nimportant aspect of cancer risk is related to inflammatoryresponse; currently, anti-inflammatory agents are used in che-mopreventive strategies. The inflammatory response involvesthe production of cytokines and proinflammatory oxidants suchas hypochlorous acid and peroxynitrite produced by neutrophilsand macrophages, respectively. These oxidants react with phe-nolic tyrosine residues on proteins to form chloro- and nitro-tyrosine. Green tea catechins and soy isoflavones have alsobeen shown to be chemopreventive; the aromatic nature ofpolyphenols makes them potential targets of hypochlorous acidand peroxynitrite, and these reactions may create novel phar-macophores at the site of inflammation. In addition, a majormechanism of the anticarcinogenic activity of green tea inanimals is the impairment of the interaction of carcinogens withDNA leading to mutations. Nevertheless, the antimutagenicactivity of green tea as well as its underlying mechanisms mustbe reviewed, and the role of GTP, the postulated bioactivecomponents, and caffeine must be critically evaluated. EGCGfrom green tea especially imparts a growth inhibitory effect oncancer cells [56,63–64]. EGCG possesses promising anticancerpotential due to its antioxidant, antimutagenic and chemopre-ventive properties [65–66].\nRosengren [67] indicated that the green tea catechins reduce\nthe proliferation of breast cancer cells in vitro and decrease\nbreast tumor growth in rodents. Furthermore, in vitro studies\nhave demonstrated that the combination of EGCG and tamox-ifen is synergistically cytotoxic to breast cancer cells; theseresults suggest that the catechins have significant potential inthe treatment of breast cancer. Mittal et al. [56] reported that\nthe treatment with EGCG decreased cell viability at differentstages studied (approx. 80% inhibition) in human breast carci-noma MCF-7 cells, but had no adverse effect on the growth ofnormal mammary cells. These authors found that this treatmentinhibited telomerase activity (40–55%); telomerase is elevatedin/H1102290% of breast carcinomas and therefore has received much\nattention as a target for breast cancer therapy and cancerdiagnostic research. According to Wu et al. [68], green tea\ndrinkers showed a significantly reduced risk of breast cancer;compared to women who did not drink green tea regularly (i.e.,less than once a month). Furthermore, there was a significanttrend of decreasing risk with increasing amount of green teaintake. Two studies in Japanese women diagnosed with breastcancer indicate that green tea consumption is inversely associ-ated with the rate of recurrence, especially in the early stages ofbreast cancer [69–70]. Zhou et al. [71] also reported that breast\ncancer is significantly less prevalent among Asian women,whose diets contain high intake of soy products and green tea.These authors suggested that dietary soy phytochemical con-\ncentrate plus green tea may be used as a potential effectivedietary regimen for inhibiting progression of estrogen-depen-dent breast cancer.\nZhang et al. [72] reported that ovarian cancer risk declined\nwith increasing frequency and duration of green tea consump-tion. Green tea is also an effective chemopreventive agent tohuman prostate cancer. In the same line of research, Yu et al.\n[73] reported that EGCG inhibited the growth of prostatecancer adenoma cells and induced apoptosis. Jian et al. [74]\nconducted a case-control study in China in order to investigatewhether green tea consumption has an etiological associationwith prostate cancer. Prostate cancer risk declined with increas-ing frequency, duration and quantity of green tea consumption.The dose-response relationships were also significant, suggest-ing that green tea is protective against prostate cancer.Yamamoto et al. [59] reported that GTP could be applied to\nenhance the effectiveness of chemo/radiation therapy to pro-mote cancer cell death while protecting normal cells.\nOn the one hand, epidemiological studies have suggested\nthat high consumption of green tea protects against the devel-opment of chronic active gastritis and decreases the risk ofstomach cancer; in addition, the ingestion of green tea beforefasting protects the intestinal mucosa against atrophy [75]. Onthe other hand, Borrelli et al. [76] concluded in a systematic\nreview, that an inverse association does not seem to existbetween green tea consumption and the risk of gastric andintestinal cancer, although green tea did show a protectiveeffect on adenomatous polyps and chronic gastritis [76]. In thesame way, Hoshiyama et al. [66] and Koizumi et al. [77] found\nno association between green tea consumption and the risk ofstomach cancer; these authors indicated that green tea con-sumption had no protective effect against stomach cancer, andsuggested the implication of other factors such as age, smoking,socioeconomic status, Helicobacter pylori infection, history of\npectic ulcer, and family history of stomach cancer along withcertain dietary components. Sasazuki et al. [78] reported an\ninverse association between green tea consumption and distalgastric cancer among women; however, these authors indicatedthat more prospective studies with detailed information areneeded to confirm the role of green tea in the occurrence ofgastric cancer. Il’yasova et al. [7] examined the association\nbetween black tea consumption and colon cancer in a popula-tion-based study in North Carolina, and concluded that, con-trary to expectation, black tea drinking did not decrease the riskof colon cancer. However, it is important to remark that majorrisk factors for colorectal cancer are family history of colorectalcancer, exposure to non-steroid anti-inflammatory drugs, cer-tain meat cooking practices, smoking, low physical activity andan elevated body mass index, and elevated intake of red meatand alcoholic beverages. Data on the effects of green tea in theprevention of this type of cancer are not available.\nSeveral authors have noted that some epidemiological stud-\nies have generated inconsistent results [54,79]. Some of these\nGreen Tea: Beneficial Effects\nJOURNAL OF THE AMERICAN COLLEGE OF NUTRITION 85Table 2. Epidemiological Studies on the Association between Green Tea Consumption and Cancer Risk\nCountry Type of study/subjectsGreen tea\nconsumptionHealth effects Reference\nBreast cancer\nJapan Prospective study\n1160 female invasive\nbreast cancer (meanage/H1100551.5 y)/H113506 cups/day\n3–5 cups/day0–2 cups/dayA decrease of the risk of cancer recurrence is\nobserved with a consumption of /H113503 cups/\nday of tea (HR /H110050.69, 95% CI /H110050.22–\n0.84). This decrease is mainly in early stagecases.Inoue et al. [70]\nUSA Case-control study\nAsian-american\nwomen\n501 breast cancer\npatients and 594controls/H1102285.7 mL/day\n0–85.7 mL/dayno drinkersThere is a significant trend of decreasing risk\nof breast cancer with increasing amount oftea intake, (OR /H110051, 95% CI /H110050.51–0.99;\nOR/H110050.71, 95% CI /H110050.51–0.99; OR /H11005\n0.53, 95% CI /H110050.35–0.78) respectively, in\nassociation with no, 0–85 mL/day and/H1102285.7 mL/day.Wuet al. [68]\nJapan Pooled of two\nprospective studieswith 35004 women5 cups/day\n/H110211 cups/dayTea intake is not associated with a lower risk\nof breast cancer (RR for women drinking/H110225 cups/day compared with /H110211 cup/day /H11005\n0.84, 95% CI /H110050.57–1.24).Suzuki et al.\n[168]\nOvarian cancer\nChina Case-control study\n254 ovarian cancer\npatients and 652controlsValidated\nquestionnaireIncreasing frequency and duration of tea\ndrinking can reduce the risk of ovarian cancer(OR/H110050.39 for those drinking tea daily, OR\n/H110050.23 for those drinking tea for /H1102230 years,\ncompared with non tea drinkers).Zhang et al. [72]\nProstate cancer\nChina Case-control study\n130 prostateadenocarcinomapatients and 274controlsFace-to-face interview\nusing a structuredquestionnaire(Almost all the teaconsumed is greentea)The prostate cancer risk declined with increasing:\nfrequency (non-drinkers for tea drinking OR /H11005\n0.28, 95% CI /H110050.17–0.47), duration (OR /H11005\n0.12, 95% CI /H110050.06–0.26 for drinking tea over\n40 years) and quantity of tea consumption (OR/H110050.09, 95% CI /H110050.04–0.21) for those\nconsuming more than 1.5 kg of tea leaves yearlyand OR /H110050.27, 95% CI /H110050.15–0.48 for those\ndrinking more than 1 L/day).Jian et al. [74]\nGastro-intestinal cancer\nJapan Case-control study\n887 gastric cancer and\n28619 control age:20–79 y6 cups/day\n3–5 cups/day1–2 cups/dayneverConsumption of more than 6 cups/day vs\nnever drinking decreased the risk of gastriccancer.Huang et al.\n[169]\nJapan Cross-sectional study\n636 men and womenmean age: men: 59.2\ny, women: 60.4 y/H1135010 cups/day\n0–9 cups/dayConsumption of more than 10 cups/day\nreduces the risk of chronic atrophic gastritis(OR/H110050.59, 95% CI /H110050.42–0.86).Shibata et al.\n[170]\nJapan Cross-sectional study\n566 menage: 50–55 y/H113505 cups/day\n3–4 cups/day/H110213 cups/dayNo relationship between tea consumption and\nrisk of chronic atrophic gastritis (OR /H110050.7,\n95% CI /H110050.5–1.2).Kuwahara et al.\n[171]\nJapan Prospective cohort\nstudy\n8552 adults/H1135010 cups/day\n4–9 cups/day/H110213 cups/dayConsumption of more than 10 cups/day\ndecrease the risk of stomach cancer (OR /H11005\n0.69, 95% CI /H110050.23–1.88) and colorectal\ncancer (OR /H110050.56, 95% CI /H110050.22–1.4).Nakachi et al.\n[88]\nJapan Prospective cohort study\n14873 men and 23667\nwomen\nHiroshima atomic bomb\nsurvivors/H113505 cups/day\n2–4 cups/day0–1 cups/dayNo relation between tea consumption and\nreduced risk of stomach cancer (OR /H11005\n0.95, 95% CI /H110050.76–1.2), colon cancer\n(OR/H110051.0, 95% CI /H110050.76–1.4) or rectum\ncancer (OR /H110051.3, 95% CI /H110050.77–2.1).Nagano et al.\n[79]\nChina Case-control study\n166 chronic atrophic\ngastritis, 133 gastriccancer and 433controls21 cups/week\n1–21 cups/weekneverSignificant inverse association between tea\ndrinking and gastric cancer (OR /H110050.39,\n95% CI /H110050.15–1.01) or chronic atrophic\ngastritis (OR /H110050.52, 95% CI /H11005\n0.28–0.99).Setiawan et al.\n[172]\n(Table continues )Green Tea: Beneficial Effects\n86 VOL. 25, NO. 2studies related tea consumption with reduced risk of cancer. In\na similar way, other authors found that tea lacks protectiveactivity against certain human cancers; these results raise ques-tions about the actual role of green tea components in humancancer that need to be addressed. For example, Arab andIl’yasova [80] provided a brief synopsis of 30 studies aimed atexamining tea consumption as a factor in the incidence of colonand rectal cancers; the 30 papers examined populations in 12countries and provided data on consumption of both black andgreen tea. These studies do not provide consistent evidence to\nsupport the theory from animal studies and basic research of teabeing a potent chemopreventive agent. A negative associationis stronger in observational epidemiologic studies of rectalcancer than in colon cancer. There is no consistent adjustmentfor important potential confounders of any tea relationship,such as coffee and alcohol consumption and physical activitylevels. Finally, these authors indicated that the assessment oftea in most of these studies was based on a single question andTable 2. Continued\nCountryType of\nstudy/subjectsGreen tea\nconsumptionHealth effects Reference\nJapan Prospective cohort\nstudy\n11902 men and\n14409 women(mean age: 46.4 y)/H113505 cups/day\n3–4 cups/day1–2 cups/day/H110211 cup/dayNo association with risk of gastric cancer\nmen: (OR /H110051.16, 95% CI /H110050.9–2.6),\nwomen: (OR /H110050.8, 95% CI /H110050.5–1.3).Tsubono et al.\n[173]\nJapan Prospective cohort\nstudy\n30370 men and\n42481 women/H1135010 cups/day\n5–9 cups/day3–4 cups/day1–2 cups/day/H110211 cup/dayNo association between tea consumption and\nstomach cancer death; men: (OR /H110051.00,\n95% CI /H110050.5–2), women: (OR /H110050.7, 95%\nCI/H110050.3–2).Hoshiyama et al.\n[174]\nJapan Prospective cohort\nstudy\n18746 men and\n26184 womenEvery day\n3 times/week/H110213 times/weekNo association between tea consumption and\nstomach cancer death; men: (OR /H110051.11,\n95% CI /H110050.75–1.63), women: (OR /H11005\n1.43, 95% CI /H110050.78–2.62).Fujino et al.\n[175]\nJapan Case-control study\n157 incident stomach\ncancer and 285controls/H1135010 cups/day\n5–9 cups/day3–4 cups/day1–2 cups/day/H110211 cup/dayNo inverse association between tea\nconsumption and the risk of stomachcancer.Hoshiyama et al.\n[66]\nEsophageal cancer\nChina Prospective\ninterventionalstudy\n778 esophageal\nprecancerouslesionIntervention group: 5\nmg/day ofdecaffeinate greentea (DGT) for 12months.DGT trial did not show apparent difference\nbetween the treatment and placebo group inalleviating the esophageal precancerouslesions and abnormal cell proliferation.Wang et al.\n[176]\nBladder cancer\nJapan Prospective cohort\nstudy\n14873 men and\n23667 women\nHiroshima atomic\nbomb survivorsA mail survey Tea consumption is not related to risk of\nbladder cancerNagano et al.\n[177]\nLung cancer\nChina Case-control study\n649 lung cancer\nwomen and 675controls womenFace-to-face\ninterviewsAmong non-smoking women, consumption of\ngreen tea was associated with a reduced riskof lung cancer (OR /H110050.65, 95% CI /H11005\n0.45–0.93), and the risks decreased withincreasing consumption.Zhong et al.\n[178]\nCancer incidence\nJapan Prospective study\n38540 people\n(14.873 men,mean age 52.8 yand 23667 women,mean age 58.8 y)/H113505 times/day\n2–4 times/day1 time/dayneverTea consumption is unrelated to incidence of\ncancers under study. (RR /H110051, 95% CI /H11005\n0.91–1.1, and RR /H110050.98, 95% CI /H110050.88–\n1.1 for all cancer consuming tea twice tofour times per day and five or more timesper day, as compared with those consumingtea once per day or less).Nagano et al.\n[79]\nHR/H11005hazard ratio; OR /H11005odd ratio; RR /H11005relative risk; CI /H11005confidence interval.Green Tea: Beneficial Effects\nJOURNAL OF THE AMERICAN COLLEGE OF NUTRITION 87therefore may have significant measurement error compared\nwith more recent studies specifically aimed at assessing greentea consumption. Table 2 summarizes some recent epidemio-logical studies on the association of green tea consumption andcancer risk.\nAnti-Hypertensive Effect And Cardiovascular Disease\nRisk. Green tea has long been believed to possess hypotensive\neffects in popular Chinese medicine. However, conflicting re-sults have been shown among trials and animal studies on therelation between tea consumption and blood pressure. Epide-miological evidence about the long-term effect of green tea onhypertensive risk is also inconsistent. Negishi et al. [81] ob-\nserved that both black and green tea polyphenols attenuateblood pressure increases, through their antioxidant properties,in stroke-prone spontaneously hypertensive rats, but theamounts of polyphenols used in this experiment correspondapprox. to those 1L of tea. Recently, some epidemiologicalstudies indicated that green tea consumption slightly reducesblood pressure. Yang et al. [82] concluded that habitual mod-\nerate strength green tea or oolong tea consumption, 120 mL/dayor more for 1 year significantly reduces the risk of developinghypertension in the Chinese population. Hodgson et al. [83]\nreported that long-term regular ingestion of green tea may havea favorable effect on blood pressure in older women. However,other studies do not support a hypotensive effect of green tea[4]. Singh et al. [84], and Murakami and Ohsato [85] reported\nthat dietary green tea intake preserves and improves arterialcompliance and endothelial function. Green tea consumptionhas also been inversely associated with the development andprogression of atherosclerosis, which is consistent with theformer observations. Geleijnse et al. [86] in their prospective\nRotterdam study with 3454 adults, 55 years of age or older, andwith a follow-up duration ranging from two to three years,examined aortic atherosclerosis via X-ray measurement of cal-cified deposits in the abdominal aorta; the odds ratio (OR) fordrinking 125–250 mL (1–2 cups) of black tea daily was 0.54(95% CI /H110050.32–0.92) and decreased to 0.31 (95% CI /H11005\n0.16–0.59) when /H11022500 mL/day (more than four cups) were\nconsumed. Data on green tea are reported by Sasazuki et al.\n[87] who in a cross sectional study of 512 coronary patients(302 men and 210 women) established that green tea may beprotective against coronary atherosclerosis in men (OR /H110050.5,\n95% CI /H110050.2–1.2 for consumption of 2–3 cups, and OR /H110050.4,\n95% CI /H110050.2–0.9 for /H113504 cups per day as compared with a\nconsumption of one cup per day or less), but not in women.Nakachi et al. [88] in a prospective cohort study of 8522 men\nand women concluded that consuming /H1135010 cups/day is linked\nwith a decreased relative risk (RR) of death from cardiovascu-lar disease in men (RR /H110050.58, 95% CI /H110050.34–0.99) and in\nwomen (RR /H110050.82, 95% CI /H110050.49–1.38).\nEpidemiological studies suggest that green tea consumption\nis associated with a reduced cardiovascular disease risk, but themechanisms for these observations have remained uncertain.Several studies have demonstrated that green tea may affect thecardiovascular function through mechanisms of action related\nto LDL-cholesterol oxidation [4,89]. The oxidation of LDL-cholesterol, associated with a risk for atherosclerosis and heartdisease, is inhibited by green tea due to EC and EGCG anti-oxidant activity. The in vitro antioxidant activity of EGCG on\nLDL oxidation was stronger than that of EC [90]. In accordancewith these observations, Trevisanato and Kim [91] indicatedthat GTP may slow atherogenesis by reducing the oxidativemodification of LDL-cholesterol and associated events such asfoam cell formation, endothelial cytotoxicity and induction ofproinflammatory cytokines. Gomikawa and Ishikawa [90] sug-gested that catechins suppressed the susceptibilities of humanLDL to oxidation by CuSO\n4in vitro and plasma oxidation in\nvivo after ground green tea ingestion. Recent bioavailability\nstudies indicate that GTP can accumulate in the body at con-centrations comparable to those employed in vitro by several\ninvestigators [31]. Other data report that catechins have been\nshown to reduce plasma cholesterol levels and the rate ofcholesterol absorption. Raederstorff et al. [92] investigated the\ndose-response and the mechanism of action of EGCG on theseparameters in rats which were fed a diet high in cholesterol andfat; after 4 weeks of treatment, total cholesterol and LDL-cholesterol plasma levels were significantly reduced in thegroup fed 1% EGCG when compared to the non-treatmentgroup. Plasma triglycerides and HDL-cholesterol did notchange significantly. These authors suggested that one of theunderlying mechanisms by which EGCG affects lipid metabo-lism is by interfering with the micellar solubilization of cho-lesterol in the digestive tract, which then in turn decreasescholesterol absorption. Yokozawa et al. [93] reported that the\nadministration of GTP effectively inhibited LDL-cholesteroloxidation and elevated serum antioxidative activity. Further-more, GTP increased the levels of HDL-cholesterol, leading todose-dependent improvement of the atherogenic index. Thus,GTP may exert an antiatherosclerotic action by virtue of itsantioxidant properties and by increasing HDL-cholesterol lev-els. Consistent with these results are the data reported byHertog et al. [94] that demonstrated an inverse correlation\nbetween catechin intake and coronary heart disease mortalityafter a 25-year follow-up of 12763 men from seven differentcountries. Similarly, another research showed that men andwomen from the Boston Area Health study who consumed oneor more cups per day of green tea in the previous year had a44% lower risk of myocardial infarction than those who drankno tea [95]. Recently, Peters et al. [96] have provided a meta-\nanalysis that suggested a decrease in the rate of cardiovasculardisease outcomes with increasing green tea consumption.Through seven studies the incidence rate of myocardial infarc-tion was estimated to decrease by 11% with an increase ingreen tea consumption of three cups per day (RR /H110050.89; 95%\nCI/H110050.79–1.019). In addition, an inverse association of green\ntea intake and myocardial infarction and its genetic variationhas been found by Hirano et al. [97] and Ohmori et al. [98].Green Tea: Beneficial Effects\n88 VOL. 25, NO. 2Impaired endothelium-derived nitric oxide activity contrib-\nutes to the pathogenesis of atherosclerosis, and in coronarycirculation, it has been linked with future cardiovascular dis-ease events. Furthermore, this endothelial dysfunction is asso-ciated with increased oxidative stress and may be reversed byantioxidant interventions [4]. Duffy et al. [99] observed that tea\nconsumption improved flow-mediated dilation, in associationwith an increased plasma catechin concentration ( p/H110210.001).\nNo effects were observed with an equivalent dose of caffeine(200 mg) or on endothelium-independent nitroglycerin-medi-ated dilation. As flow-mediated dilation is blunted in coronaryheart disease patients compared to healthy subjects, these re-sults suggest that green tea reverses endothelial vasomotordysfunction. Hertog et al. [100] reported no association of\ncatechin by tea intake with ischemic heart disease incidence ina 14-year follow-up of 334 men, 45 to 59 years of age, con-ducted in Caerphilly, Wales. According to McAnlis et al. [101],\nthe discrepancy between the effect of green tea in vivo andex\nvivo, on the susceptibility of LDL-cholesterol to oxidation may\nbe due to the inability to achieve concentrations in vivo as great\nas those obtained with the former methods. The possible vari-ations between the different studies may be also due to theirignorance of socioeconomic and lifestyle factors associatedwith the green tea drinking (i.e., geographical differences,social class, body mass index, healthy lifestyle, higher preva-lence of smoking, higher fat intake, alcohol intake, coffeeconsumption).\nOral Health. Oral diseases including dental caries, peri-\nodontal disease, and tooth loss may significantly impact aperson’s overall health. Among these, dental caries is a multi-factorial infectious disease in which nutrition, microbiologicalinfection, and host response play important roles. Earlier re-ports in experimental animals and humans suggested that greentea consumption (without added sugar) reduces dental caries[5,102–103]. Linke and LeGeros [104] indicated that frequentintake of green tea can significantly decrease caries formation,even in the presence of sugars in the diet. In vivo animal studies\nhave shown that specific pathogen-free rats infected with Strep-\ntococcus mutans and then fed with a cariogenic diet containing\nGTP have significantly lower caries scores [105]. Supplement-ing drinking water of rats with 0.1% GTP along with a cario-genic diet also significantly reduced total fissure caries lesions[5]. Recent findings of Okamoto et al. [106] suggest that green\ntea catechins may have the potential to reduce periodontalbreakdown resulting from the potent proteinase activity ofPorphyromonas gingivalis . In addition, green tea decoctions\ninhibit\n/H9251-amylase in human saliva, reducing maltose release by\n70% and effectively lowering the cariogenic potential of starch-containing food [4]. Similarly, Zhang and Kashket [107] re-ported that green tea extracts inhibits human salivary amylaseand may reduce the cariogenic potential of starch-containingfood such as crackers and cakes because it may reduce thetendency of this kind of food to serve as slow-release sourcesof fermentable carbohydrate. It is likely that the cariogenicchallenge in a cariogenic diet may be reduced by the simulta-\nneous presence of green tea in the diet.\nApart from their polyphenol content, both green and black\ntea, are a natural source of fluoride and an effective vehicle forfluoride delivery to the oral cavity. According to Simpson et al.\n[108], after cleansing the mouth with tea, approximately 34%of the fluoride is retained and shows a strong binding ability tointeract with the oral tissues and their surface integuments. Thisfluoride content may have a beneficial impact on caries andmay carry out a wide range of biological activities includingprevention of tooth loss and oral cancer [106,109]. Nonethe-less, the data have suggested that GTP extract may be respon-sible for the noted effects on oral health and it has been alsodemonstrated that GTP rather than fluoride contribute to anti-cariogenic potential [5,105] by inhibition of oral bacteriagrowth such as Escherichia coli ,Streptococcus salivarius , and\nStreptococcus mutans . Several studies have indicated that GTP\ninhibit growth, acid production, metabolism, and glucosyltrans-ferase enzyme activity of S. mutans and dental plaque bacteria\n[5]. In consequence, green tea has been considered as func-tional food for oral health and is widely used in toothpasteformulation.\nSolar Ultraviolet Protection. Epidemiological, clinical and\nbiological studies have shown that solar ultraviolet (UV) lightis a complete carcinogen and repeated exposure can lead to thedevelopment of various skin disorders including melanoma andnon-melanoma skin cancers. EGCG is considered to be a topicprotector agent against some types of radiation, since it pre-vents skin disease, photoaging and potential cancer problemsdue to prolonged exposure [109–111]. It seems that the rest ofcatechins also favour this action [5,109–110]. Katiyar [111]indicated that topical treatment or oral consumption of GTPinhibits chemical carcinogen or UV radiation-induced skincarcinogenesis in different laboratory animal models. Topicaltreatment of GTP or ECCG and oral consumption of GTPresulted in prevention of UVB-induced inflammatory re-sponses, immunosuppression and oxidative stress, which arethe biomarkers of several skin disease conditions. Topicalapplication of GTP and EGCG prior to exposure of UVBprotects against UVB-induced local as well as systemic im-mune suppression in laboratory animals. This fact was associ-ated with the inhibition of UVB-induced infiltration of inflam-matory leukocytes. The in vitro andin vivo animal and human\nstudies have suggested that GTP are photoprotective in nature,and can be used as pharmacological agents for the preventionof solar UVB light-induced skin disorders including photoag-ing, melanoma and non-melanoma skin cancers [4–5,109,111].\nBody Weight Control. Obesity has increased at an alarm-\ning rate in recent years and is now a worldwide health problem.Current interest in the role of functional foods in weight controlhas focused on plant ingredients capable of interfering with thesympathoadrenal systems [112]. The effects of long-term feed-ing with tea catechins have been widely studied, and someinvestigators suggest a potential role of green tea in bodyGreen Tea: Beneficial Effects\nJOURNAL OF THE AMERICAN COLLEGE OF NUTRITION 89weight control. In addition, caffeine and theanine have been\nfound to strengthen polyphenol effects on body weight controland fat accumulation in mice [113]. In vitro studies with green\ntea extracts containing 25% of catechins have shown its capac-ity (in conditions similar to physiological ones) to significantlyinhibit the gastric lipase, and in a lower extent also the pan-creatic lipase. Thus, the lipolysis of long-chain triglycerides isreduced in a 37% [114]. In vitro studies have also shown that\ngreen tea extracts interfere in the fat emulsification process,which occurs before enzymes act, and is indispensable for lipidintestinal absorption [114–115]. Green tea also exhibits a fattyacid synthase inhibitor activity [116]. In addition, green teamay have thermogenic properties not only attributable to itscaffeine content, but to the joint-effect of caffeine and cat-echins. EGCG can act upon AMPc levels by increasing theenergetic expenditure [114]. Dulloo et al. [112] using a green\ntea extract rich in catechins and caffeine, concluded that greentea has thermogenic properties and promotes fat oxidationbeyond than those explained by its caffeine content per se ; the\ngreen tea extract may play a role in the control of bodycomposition via sympathetic activation of thermogenesis, fatoxidation, or both. Dulloo et al. [117] indicated that the ther-\nmogenic properties of green tea could reside primarily in aninteraction between its high content in catechins and the pres-ence of caffeine with sympathetically released noradrenaline;since polyphenols are known to be capable of inhibiting cate-chol-o-methyl-transferase (the enzyme that degrades noradren-aline), and caffeine of inhibiting trancellular phosphodiester-ases (enzymes that break down noradrenaline-induced AMPc).Such a synergistic interaction between polyphenols and caf-feine to increase and prolong sympathetic stimulation of ther-mogenesis could be of value in assisting the management ofobesity. Kovacs et al. [118] reported that weight maintenance\nafter 7.5% of body weight loss in overweight and moderatelyobese subjects was not affected by green tea treatment and thatregular caffeine consumption affected weight maintenance ingreen tea treatment. According to some authors, green teaextracts (with a 25% of catechins content) may be advisable foroverweight treatment in patients whose body mass index rangesbetween 25 and 29.9 kg/m\n2, only if they do not present special\nsensitiveness to xantic bases [118]. Wu et al. [119] indicated\nthat an inverse relationship may exit among regular green teaconsumption, body fat percentage, and body fat distribution,especially for subjects who have maintained the habit of teaconsumption for more than 10 years.\nGlucose Tolerance and Insulin Sensitivity. Epidemiolog-\nical observations and laboratory studies have shown that greentea has an effect on glucose tolerance and insulin sensitivity.Anderson and Polansky [120] reported that green tea increasesinsulin activity, and that the predominant active compound isEGCG; these same authors indicated that addition of lemon tothe tea did not affect the insulin-potentiating activity but theaddition of 50 g of milk per cup decreased the insulin-poten-tiating activity similar to 90%. Wu et al. [121] examined theeffect of green tea supplementation on glucose tolerance and\ninsulin sensitivity in rats; rats were divided into two groups: acontrol group was fed with standard chow and deionized dis-tilled water, while the other was fed with the same chow dietbut with green tea instead of water (0.5 g of lyophilized greentea powder dissolved in 100 mL of deionized distilled water);after 12 weeks of green tea supplementation, this group hadlower fasting plasma levels of glucose, insulin, triglycerides,and free fatty acid than the control rats. In addition, GTPsignificantly increased basal and insulin-stimulated glucoseuptake of adipocytes [4]. Some investigations have also shownthat EGCG does not only regulate the glucose level in blood,but also may rehabilitate damaged beta-cells, which are respon-\nsible for producing insulin [4,119].\nOther Effects. Green tea catechins have been reported to\nhave antibacterial and antiviral activity. Green tea effectivenessagainst any type of diarrhoea and typhoid has been known inAsia since ancient times [4,68,119]. Nowadays it is also knownthat it inhibits the reproduction and growth of many bacteria,among which some types of Salmonella ,Clostridium orBacil-\nluscan be named. Takabayashi et al. [122] and Yee et al. [123]\nreported an inhibitory effect of green tea catechins on Helico-\nbacter pylori infection. Moreover, it has been shown that green\ntea has not effect over intestinal flora, which is a great advan-tage against other bactericide agents. Regarding its antiviralaction, green tea is well known for preventing tobacco cropsfrom being invaded by the ‘mosaic virus’ of tobacco. Recentinvestigations have confirmed that catechins completely inhibitits growth and reproduction [3]. Effects of green tea against theinfluenza virus, especially in its earliest stage, as well as againsttheHerpes simplex virus have also been demonstrated [124–\n126]. Furthermore, Weber et al. [127] observed that adenovirus\ninfection is inhibited in vitro by green tea catechins. Hirasawa\nand Takada [128] indicated the antifungal activity of green teacatechins against Candida albicans , and the convenience of a\ncombined treatment with catechins and lower doses of antimy-cotics; this treatment may help to avoid the side effects ofantimycotics.\nGreen tea consumption has also been associated with in-\ncreased bone mineral density, and it has been identified as anindependent factor protecting against the risk of hip fractures;this fact has been considered independent of smoking status,hormone replacement therapy, coffee drinking and the additionof milk to tea [129]. Park et al. [130] observed the positive\neffects of green tea extracts and GTP on the proliferation andactivity of bone cells. Wu and Wei [5] indicated that bonemineral density may be influenced by several chemical com-pounds that are contained in tea extracts (i.e., caffeine, phyt-ostrogen, fluoride, . . .).\nGreen tea polyphenols are known to have anti-fibrotic prop-\nerties on the skin and on the arteries. The proliferation ofhepatic stellate cells is closely related to the progression of liverfibrosis in chronic liver diseases, and EGCG has a potentialinhibitory effect on the proliferation of these cells [131–132].Green Tea: Beneficial Effects\n90 VOL. 25, NO. 2Green tea strengthens the immune system action since green tea\nprotects it against oxidants and radicals. Bayer et al. [133]\nsuggest that oral intake of green tea could act as an adjunctivetherapy for prevention of transplant rejection in humans. Theneuroprotective power of complex extracts rich in flavonoidslike those of Ginkgo biloba , green tea or lyophilized red wine\nhave been demonstrated in several studies [134–135]. Recentstudies suggest that GTP possibly protect against Parkinson’sand Alzheimer’s diseases and other neurodegenerative diseases[44,136]. GTP have demonstrated neuroprotectant activity incell cultures and animal models, such as the prevention ofneurotoxin-induced cell injury; the biological effects of GTPmay benefit patients with Parkinson’s disease, but further in-depth studies are needed to investigate the safety and effective-ness of green tea in humans and to determine the differentmechanisms of green tea in neuroprotection [44]. In the sameway, the neuroprotective effects of the theanine contained ingreen tea are a focus of considerable attention, and furtherstudies are warranted [134].\nFinally, the following health effects of green tea consump-\ntion have also been described. Green tea is considered to beuseful for insect stings due mainly to its antiinflammatoryeffects and its capacity to stop bleeding [137–138]. Somestudies have suggested an inverse association between greentea consumption and the risk of kidney stone formation [4,139].In addition, green and black tea extracts led to a retardation ofthe progression of lens opacity in rats with cataracts induced byselenite [140]. Gupta et al. [141] reported that green tea acts by\npreserving the antioxidant defense system of the lens. Skrzy-dlewska et al. [142] indicated a beneficial effect of green tea in\nalcohol intoxication. Besides all the above mentioned proper-ties, which have helped to the recognition of green tea asfunctional food by some authors [143], it is not to forget itscurrent use in the preparation of a variety of food, pharmaceu-tical preparations, dentifrices and cosmetics [144]. This addi-tional use is mainly due to its antioxidant activity, which makesit a natural, efficient and safe preservative.\nGreen Tea Nutritional Value\nGreen tea consumption contributes to the overall daily fluid\nintake, and if sugar is not added, the calories intake is insig-nificant; besides, the caffeine intake is lower than in coffee,black tea or cola soft-drinks. In addition, green tea contributionto the dietary intake of antioxidant compounds (catechins andother phytochemical substances, certain vitamins as vitamin C,and minerals as Mn, Cr, Se, Zn) is very interesting to promotehuman health and well being, and more relevant than that othernon-alcoholic beverages widely consumed. The Mn content ishigh, and tea is considered a rich source of this essentialelement [21,145]. Manganese is a constituent of three metalloen-zymes (i.e., arginase, pyruvate carboxylase, and Mn-superoxidedismutase) and it activates a large number of enzymes, such asglycosyl transferases, involved in mucopolysaccharide synthesis[146]. Manganese deficiency can cause abnormalities in the me-\ntabolism of carbohydrates, glycosaminoglycans, and cholesterol[147]. Chromium, selenium and zinc play also an important role inhuman metabolism, and interest in these elements is increasingsince there are reports relating trace element status and oxidativediseases. Chromium is involved in carbohydrate and lipid metab-olism; the most frequent sign of Cr deficiency is altered glucosetolerance; this nutrient has been associated with diabetes andcardiovascular diseases [146]. Beneficial effects of dietary Crsupplementation, particularly in groups in which deficiencies arefrequent, have been reported [147]. Garcia et al. [148] measured\nthrough duplicate diet sampling the Cr dietary intake in Spain anddetected that the most elevated intakes are related to high con-sumption of infusions, especially tea and coffee. Selenium func-tions through selenoproteins, several of which are oxidant defenseenzymes; Se acts as enzymatic cofactor of glutathione peroxidasein the elimination of peroxide radicals from the organism. Epide-miological studies have shown the possible effects of Se in theprevention and regression of cancer [146–147]. Most Se is in-gested in food, but food derived from vegetables has a variable Secontent depending on the zone where they have been cultivated[149]. Zinc enzymes participate in a wide variety of metabolicprocesses including carbohydrate, lipid, and protein synthesis ordegradation. This element is required for deoxyribonucleic andribonucleic acid synthesis; it may also play a role in stabilizingplasma membranes [147]. Zinc has been recognized as a cofactorof the superoxide dismutase enzyme, which is involved in protec-tion against oxidative processes [146]. Recently there has been adevelopment of terminology and change in conceptual approachestowards setting nutrient recommendations from adequate to opti-mum nutrition [150]. Regarding antioxidant minerals, the USFood and Nutrition Board has set an Adequate Intake for Mn at 2.3and 1.8 mg/day for adult men and women, respectively, and aTolerable Upper Intake Level at 11 mg/day for adults. ChromiumAdequate Intake values are 35 and 25\n/H9262g/day for young men and\nwomen, respectively. The Recommended Dietary Allowance forZn is 8 and 11 mg/day for adult men and women, respectively; theTolerable Upper Intake Level for adults is 40 mg/day. The sele-nium Recommended Dietary Allowance and Tolerable UpperIntake Level for adults is 55 and 400\n/H9262g/day, respectively [151–\n152]. Table 3 summarizes data on the content of minerals withantioxidant activity in green tea.\nIn addition, green tea contains more vitamin C than black\nand oolong teas [153]; the total content of vitamin C in tealeaves decreased during the manufacturing process of fer-mented teas [154], however bibliographical data on vitamin Ccontent in green tea are scarce. Due to the fact that green teaconsumption in the occidental diets (except Morocco) is scarceand occasional, its contribution to the total antioxidant dietaryintake is low [155]. For example, Pulido et al. [156] evaluated\nthe contribution of the most consumed beverages to the anti-oxidant intake in the Spanish diet; the intake is estimated at1623 mg of vitamin E and 598 mg of vitamin C by FRAPprocedure. Tea only contributes to 3–5% of the total, whereasGreen Tea: Beneficial Effects\nJOURNAL OF THE AMERICAN COLLEGE OF NUTRITION 91coffee and red wine are the main contributors. However, all the\nabove mentioned properties of green tea, demonstrate that itcan be considered an alternative to other widely consumeddrinks, which have a higher content of energy and/or caffeine,and are richer in sugars, alcohol, CO\n2, etc. Besides, drinking tea\nis an optimum way of fighting thirst due to its refreshingproperties, its slightly bitter taste, its low binding effect and itsfruity and agreeable smell [149,157]. Its preparation is easy,uncomplicated and varied (lemon, mint, cinnamon, . . . can beadded to it).\nHarmful Effects of Tea Over Consumption\nHarmful effects of tea over consumption (black or green)\nare due to three main factors: (1) its caffeine content, (2)aluminum presence, and (3) the effects of tea polyphenols oniron bioavailability. A day-long consumption of green tea im-proved the cognitive and psychomotor performance of healthyadults in a manner similar to coffee, but green tea (whichcontains less caffeine) is less likely than coffee to disrupt sleepquality at night [4]. Lin et al. [19] compared the caffeinecontent in the same type of tea but manufactured by different\nfermentation processes, and concluded that the caffeine levelpresented the following order: black tea /H11022oolong tea /H11022green\ntea/H11022fresh tea leaf. Cabrera et al. [22] determined the caffeine\ncontent in a total of 45 tea samples, including ‘fermented’ teas(red and black teas), oolong tea and green tea samples; theresults showed that caffeine presence is higher in the case ofblack teas (41.5–67.4 mg/g), whereas green and oolong teasshow a mean caffeine content of 32.5 and 29.2 mg/g, respec-\ntively. Fernandez et al. [20] also reported that caffeine content\nis higher in the case of ‘fermented’ teas, showing values be-tween 2.4 and 4.8%, whereas ‘non-fermented’ teas show caf-feine levels ranging between 1.47 and 3.86%. Table 4 includesdata on the caffeine content in beverages widely consumed.The caffeine content in green tea may vary according to thetype of tea and the form of preparation (i.e., brewing time);generally, bagged tea produces a higher percentage of caffeinethan tea leaves [3]. In any case, although green tea caffeinecontent is low, its consumption is not advisable in cases ofspecial sensitiveness to xanthic bases. The negative effectsTable 3. Antioxidant Minerals Content in Green Tea Leaves (Data Referred to Dry Weight)\nMineral Content (mean; range) Class (origin) Reference\nCr 238.6 ng/g sencha (Japan) Cabrera et al. [22]\n291.0 ng/g jasmine (Japan) Cabrera et al. [22]\n219.8 ng/g Kokaicha (Japan) Cabrera et al. [22]\n111.9 ng/g Bancha (Japan) Cabrera et al. [22]\n141.7 ng/g Paimutan (China) Cabrera et al. [22]\n118.4 ng/g gunpower (China) Cabrera et al. [22]\nMn 699 /H9262g/g (160–1500) A set of samples (China) Xie et al. [21]\n1069.7 /H9262g/g sencha (Japan) Ferna ´ndez-Ca ´ceres et al. [10]\n1021.5 /H9262g/g gunpower (China) Ferna ´ndez-Ca ´ceres et al. [10]\n714.9/H9262g/g jasmine (China) Ferna ´ndez-Ca ´ceres et al. [10]\n500.7/H9262g/g sencha (Japan) Cabrera et al. [22]\n354.1/H9262g/g jasmine (Japan) Cabrera et al. [22]\n651.3/H9262g/g Kokaicha (Japan) Cabrera et al. [22]\n987.6/H9262g/g Bancha (Japan) Cabrera et al. [22]\n236.6/H9262g/g Paimutan (China) Cabrera et al. [22]\n518.9/H9262g/g gunpower (China) Cabrera et al. [22]\nSe 0.18* /H9262g/g (0.03–7.5) A set of samples (China) Xie et al. [21]\n455/H11006184 ng/g “high Se tea” (China) Yoshida et al. [179]\n92.9 ng/g sencha (Japan) Cabrera et al. [22]\n89.7 ng/g jasmine (Japan) Cabrera et al. [22]\n48.5 ng/g Kokaicha (Japan) Cabrera et al. [22]\n80.1 ng/g Bancha (Japan) Cabrera et al. [22]\n75.1 ng/g Paimutan (China) Cabrera et al. [22]\n70.2 ng/g gunpower (China) Cabrera et al. [22]\nZn 39.4* /H9262g/g (20–60) A set of samples (China) Xie et al. [21]\n24.6/H9262g/g sencha (Japan) Ferna ´ndez-Ca ´ceres et al. [10]\n28.4/H9262g/g gunpower (China) Ferna ´ndez-Ca ´ceres et al. [10]\n44.3/H9262g/g jasmine (China) Ferna ´ndez-Ca ´ceres et al. [10]\n78.1 ng/g sencha (Japan) Cabrera et al. [22]\n78.6 ng/g jasmine (Japan) Cabrera et al. [22]\n76.1 ng/g Kokaicha (Japan) Cabrera et al. [22]\n65.0 ng/g Bancha (Japan) Cabrera et al. [22]\n75.1 ng/g Paimutan (China) Cabrera et al. [22]\n57.5 ng/g gunpower (China) Cabrera et al. [22]\n* Geometric mean.Green Tea: Beneficial Effects\n92 VOL. 25, NO. 2produced by caffeine are nervousness, sleep disorders, vomits,\nheadaches, epigastric pain, tachycardia [38–39]. Theophyllinenegative effects are similar to those of caffeine, but they onlyoccur with high quantities intake. Thus, green tea should not betaken by patients suffering from heart conditions or majorcardiovascular problems. Pregnant and breast feeding womenshould drink no more than 1–2 cups/day, since it can cause anincrease in heart rhythm. It is also convenient to control theconcomitant consumption of green tea and some drugs, due toits diuretic effects [39].\nRegarding aluminum presence in black and green tea, some\nstudies revealed the high capacity of this plant to accumulateAl. This aspect is important for patients with renal failuresbecause Al can be accumulated by the body, resulting inneurological diseases; it is therefore necessary to control theintake of food with high amounts of this metal [1]. The possibleconnection between elevated tissue Al content and problemssuch as osteomalacia and neurodegenerative disorders (i.e.,Alzheimer’s disease) has awakened interest in Al intake viadiet [158]. Minoia et al. [159] found concentrations of Al in\ngreen and black teas (as infusions) accounting for 431–2239\n/H9262g/L, whereas in coffee they found lower concentrations (9.1–\n30.8/H9262g/L). In a study carried out in Italy, these authors\nestimated the tea contribution to the total Al dietary intake as665\n/H9262g/week (considering a weekly mean consumption of 2\ncups). According to several authors, Al dietary intake must notexceed 6 mg/day in order to avoid potentially toxic levels[160]. Lo ´pez et al. [158] evaluated Al presence in food and\nbeverages widely consumed in Spain, and found that Al levelsin tea ranged from 43.42 to 58.04\n/H9262g/g referred to dry weight\nof the solid product, and from 13.91 to 27.45 /H9262g/L in the\ncorresponding infusions; levels in coffee samples varied be-tween 25.6 and 29.08\n/H9262g/g referred to dry weight of the solid\nproduct, and from 7.12 to 9.14 /H9262g/L in the corresponding\ninfusions. Costa et al. [1] observed that black tea contains\nnearly six-fold more Al than green tea, and the extraction of Alin black teas was higher than the one observed in green teas; the\nAl concentrations in the tea infusions were constant after 5 minof extraction. These authors also indicated that the variationsbetween different samples may be due to different soil condi-tions as well as different harvesting periods, and the influenceof the water quality. Following this line of study, severalauthors considered that this element does not seem to be muchmore bioavailable in tea than in other dietary sources [1,161].Even so, it cannot be ignored that tea infusions may containparticularly bioavailable and neurotoxic compounds such as Almaltolate, but this is currently speculative [161]. At this re-spect, Costa et al. [1] reported that the composition of Al\nspecies could vary depending on the method of tea production,and for non-fermented teas, most of the leached Al is mainlyfound in large or small organic compounds; in organic com-plexes with small molecular masses, such as citrates, the Al-complexes are more bioavailable than in inorganic complexes(such as hydroxide), but generally, Al is poorly absorbed by thebody. Thus, future studies designed to accurately assess thepresence and bioavailability of Al in green tea leaves is nec-essary.\nSeveral studies have demonstrated that black tea appears to\ninhibit the bioavailability of non-heme iron by 79% to 94%when both are consumed concomitantly; the impact of thisinteraction depends on the iron intake and iron status of theindividual [162–163]. Likewise, green tea catechins may havean affinity for iron, and green tea infusions can cause a signif-icant decrease of the Fe bioavailability from the diet [164]. Onthe one hand, some authors affirm that tea should not be\nconsumed by patients suffering from anaemia. For example,iron deficiency anaemia among children in Saudi Arabia andthe United Kingdom may be exacerbated by the regular con-sumption of tea with meals [165–166]. On the other hand, thiseffect may be of benefit to patients with genetic hemochroma-tosis [4]. It is worth noting that the interaction between tea andiron can be mitigated by the addition of lemon or consumingtea between meals.\nConclusions\nGreen tea has been consumed in China and other Asian\ncountries since ancient times in order to maintain and improvehealth. Nowadays, green tea is considered one of the mostpromising dietary agents for the prevention and treatment ofmany diseases and consequently, it is being studied extensivelyworldwide. Numerous studies in a variety of experimentalanimal models have demonstrated that aqueous extract of themayor GTP designed as catechins (EGCG, EGC, ECG and EC)possess antioxidant, antimutagenic, antidiabetic, anti-inflam-matory, antibacterial and antiviral, and above all, cancer-pre-ventive properties. Epidemiological studies suggest that con-sumption of green tea may have a protective effect against thedevelopment of several cancers. Preclinical studies of green teaTable 4. Caffeine Content in Food and Beverages\nProduct Caffeine content*\nNormal coffee 80–115 mg/150 mL†\nEspresso coffee 108–180 mg/150 mL\nInstant coffee 65 mg/150 mLDecaffeinated coffee 1–3 mg/150 mLGreen tea (3 min brewing time) 15–25 mg/150 mLBlack tea (3 min brewing time) 40–70 mg/150 mLOolong tea 18–33 mg/150 mLDecaffeinated tea 0.6–3 mg/150 mLIced tea 70 mg/360 mLCocoa milk shake 5 mg/240 mLHot chocolate 4 mg/150 mLPlain chocolate (bar) 15 mg/20 gMilk chocolate (bar) 5 mg/20 gCola soft drink 38–46 mg/360 mL\n* A consumption higher than 200 mg/day is not advisable.\n†Quantities vary according to the beverage preparation.Green Tea: Beneficial Effects\nJOURNAL OF THE AMERICAN COLLEGE OF NUTRITION 93and its polyphenolic components have demonstrated antimuta-\ngenic and anticarcinogenic activity, and inhibition of growth oftumor cell lines and animal tumor models, including cancer.Green tea may also have chemopreventive properties, andenhancement of chemotherapeutic agents has been demon-strated. In addition, several epidemiological studies with hu-mans have demonstrated that regular green tea consumptionhas beneficial effects and it shows a significant rate of protec-tion against the development of some oral diseases and againstsolar radiations. It also contributes to body weight control andto the rise of bone density as well as being able to stimulate theimmune system. Furthermore, green tea consumption has beenrecently reported to act positively against neurodegenerativediseases such as Parkinson and Alzheimer disease. Catechinantioxidant power is also strengthened by the presence of otherphenolic compounds, vitamin C and minerals such as Cr, Mn,Se, and Zn, although specific data regarding this fact are stillscarce.\nHowever, conflicting results between cohort studies con-\nducted in different countries may also arise from confusion inthe frequency and timing of intake, and the marked contrasts inthe socioeconomic and lifestyle factors associated with teadrinkers. It is also important to consider the type of tea or itspreparation (e.g., short time vs.long brewing time and hot tea\nvs.iced tea) due to the marked impact of these factors on\npolyphenol content and concentration. It is also important todraw attention on the need of further-in-depth studies on thenature and mechanisms of the active green tea compounds, onthe bioavailability of the different catechins in humans, andappropriate dose levels to act as functional food.\nSince green tea beneficial health effects are being increas-\ningly proved, it could be advisable to encourage the regularconsumption of this widely available, tasty and inexpensivebeverage as an interesting alternative to other drinks, which donot only show the beneficial effects of green tea, but are alsomore energetic, do contain more caffeine (green tea containsless caffeine than black tea, coffee or cola soft-drinks), are richin additives and/or CO\n2. While no single food item can be\nexpected to provide a significant effect on public health, it isimportant to note that a modest effect between a dietary com-ponent and a disease having a major impact on the mostprevalent causes of morbidity and mortality, i.e., cancer andheart disease, should merit substantial attention. Taking all thisinto account, it would be advisable to consider the regularconsumption of green tea in Western diets.\nACKNOWLEDGMENT\nWe thank M.J. Martinez-Vique for revising the English\ngrammar of the original manuscript. We thank Antiguo Tosta-dero (specialized tea shop) for its cooperation and interest inthis research.REFERENCES\n1. Costa LM, Gouveia ST, Nobrega JA: Comparison of heating\nextraction procedures for Al, Ca, Mg and Mn in tea samples. AnnSci 18:313–318, 2002.\n2. Rietveld A, Wiseman S: Antioxidant effects of tea: Evidence\nfrom human clinical trials. J Nutr 133:3275–3284, 2003.\n3. Willson KC: “Coffee, Cocoa and Tea.” New York: CABI Pub-\nlishing, 1999.\n4. McKay DL, Blumberg JB: The role of tea in human health: An\nupdate. J Am Coll Nutr 21:1–13, 2002.\n5. Wu CD, Wei GX: Tea as a functional food for oral health.\nNutrition 18:443–444, 2002.\n6. Zuo Y, Chen H, Deng Y: Simultaneous determination of cat-\nechins, caffeine and gallic acids in green, Oolong, black andPu-erh teas using HPLC with a photodiode array detector. Ta-\nlanta 57:307–316, 2002.\n7. Il’yasova D, Martı ´n C, Sandler RS: Tea intake and risk of colon\ncancer in African-Americans and Whites: North Carolina coloncancer study. Cancer Causes Control 14:676–772, 2003.\n8. Diplock AT, Aggett PJ, Ashwell M, Bornet F, Fern EB, Rober-\nfroid MB: Scientific concepts of functional foods in Europeconsensus document. Br J Nutr 81:1–27, 1999.\n9. Roberfroid MB: Global view on functional foods: European per-\nspectives. Br J Nutr 88:133–138, 2002.\n10. Ferna ´ndez-Ca ´ceres PL, Martin MJ, Pablos F, Gonza ´lez AG:\nDifferentiation of tea ( Camelia sinensis ) varieties and their geo-\ngraphical origin according to their metal content. J Agric FoodChem 49:4775–4779, 2001.\n11. Shu WS, Zhang ZQ, Lan CY, Wong MH: Fluoride and aluminum\nconcentrations of tea plants and tea products from Sichuan Prov-ince, PR China. Chemosphere 52:1475–1482, 2003.\n12. Fung KF, Zhang ZQ, Wong JWC, Wong MH: Aluminum and\nfluoride concentrations of the three tea varieties growing at Lan-tau Island, Hong Kong. Environ Geochem Health 25:219–232,2003.\n13. Xu J, Zhu SG, Yang FM, Cheg LC, Hu Y, Pan GX, Hu QH: The\ninfluence of selenium on the antioxidant activity of green tea. JSci Food Agric 83:451–455, 2003.\n14. Vison J, Dabbagh Y, Serry M, Jang J: Plant flavonoids, especially\ntea flavonols, are powerful using an in vitro oxidation model for\nheart disease. J Agric Food Chem 43:2800–2802, 1995.\n15. USDA: “USDA Database for the Flavonoid Contents of Selected\nFoods.” Beltsville: US Department of Agriculture, 2003.\n16. Hakim I, Harris R, Weisgerber U: Tea intake and squamous cell\ncarcinoma of the skin: Influence of type of tea beverages. Cancer\nEpidemiol Biomarkers Prev 9:727–731, 2000.\n17. Arts I, Van De Putte B, Hollman O: Catechins contents of foods\ncommonly consumed, in the Netherlands. Tea, wine, fruit juices,and chocolate milk. J Agric Food Chem 48:1752–1757, 2000.\n18. Wang LF, Kim DM, Park JD, Lee CY: Various antibrowning\nagents and green tea extract during processing and storage. J FoodProcess Pres 27:213–225, 2003.\n19. Lin YS, Tsai YJ, Tsay JS, Lin JK: Factors affecting the levels of\ntea polyphenols and caffeine in tea leaves. J Agric Food Chem51:1864–1873, 2003.\n20. Ferna ´ndez PL, Pablos F, Martı ´n MJ, Gonza ´lez AG: Study ofGreen Tea: Beneficial Effects\n94 VOL. 25, NO. 2catechin and xanthine profiles as geographical tracers. J Agric\nFood Chem 50:1833–1839, 2002.\n21. Xie M, Von Bohlen A, Klockenka ¨mper R, Jian X, Gu ¨nther K:\nMultielement analysis of Chinese tea ( Camellia sinensis )b y\ntotal-reflection X-ray fluorescence. Z Lebensm Unters For 207:31–38, 1998.\n22. Cabrera C, Gime ´nez R, Lo ´pez MC: Determination of tea com-\nponents with antioxidant activity. J Agric Food Chem 51:4427–4435, 2003.\n23. Henning SM, Fajardo-Lira C, Lee HW, Youssefian AA, Go\nVLW, Heber D: Catechin contents of 18 teas and green tea extractsupplement correlates with the antioxidant capacity. Nutr Cancer45:226–235, 2003.\n24. Manach C, Scalbert A, Morand C, Re ´me´sy C, Jime ´nez L: Poly-\nphenols: food sources and bioavailability. Am J Clin Nutr 79:727–747, 2004.\n25. Okushio K, Matsumoto N, Kohri T, Suzuki M, Nanjo F, Hara Y:\nAbsorption of tea catechins into rat portal vein. Biol Pharm Bull19:326–329, 1996.\n26. Kim S, Lee MJ, Hong J: Plasma and tissue levels of tea catechins\nin rats and mice during chronic consumption of green tea poly-phenols. Nutr Cancer 37:41–48, 2000.\n27. Yang CS, Chen L, Lee MJ, Balentine D, Kuo M, Schantz SP:\nBlood and urine levels of tea catechins after ingestion of differentamounts of green tea by human volunteers. Cancer EpidemiolBiomarkers Prev 7:351–354, 1998.\n28. Higdon JV, Frei B: Tea catechins and polyphenols: health effects,\nmetabolism, and antioxidant functions. Crit Rev Food Sci Nutr43:89–143, 2003.\n29. Chow HH, Cai Y, Alberts DS: Phase I pharmacokinetic study of\ntea polyphenols following single-dose administration of epigal-locatechin gallate and polyphenon E. Cancer Epidemiol Biomar-kers Prev 10:53–58, 2001.\n30. Lu H, Meng XF, Lee MJ, Li C, Maliakal P, Yang CS: Bioavail-\nability and biological activity of tea polyphenols. Food Factors inHealth Promotion and Disease Prevention Symposium Series851:9–15, 2003.\n31. Scalabert A, Williamson G: Dietary intake and bioavailability of\npolyphenols. J Nutr 130:2073S–2085S, 2000.\n32. Loktionov A, Bingham S, Vorster H, Jerling J, Runswick S,\nCummings J: Apolipoprotein E genotype modulates the effect ofblack tea drinking on blood lipids and blood coagulation factors:A pilot study. Br J Nutr 79:133–139, 1998.\n33. Leenen R, Roodenburg A, Tijburg L, Wiseman S: A single dose\nof tea with or without milk increases plasma antioxidant activityin humans. Eur J Clin Nutr 54:87–92, 2000.\n34. Van het Hof K, Kivits G, Weststrate J, Tijburg L: Bioavailability\nof catechins from tea: The effect of milk. Eur J Clin Nutr52:356–359, 1998.\n35. Hollman PC, Van Het Hof K, Tijburg L, Katan MB: Addition of\nmilk does not affect the absorption of flavonols from tea in man.Free Radic Res 34:297–300, 2001.\n36. Langley-Evans S: Consumption of black tea elicits and increases\nin plasma antioxidant potential in humans. Int J Food Sci Nutr51:309–315, 2000.\n37. Xu JZ, Yeung SY, Chang Q, Huang Y, Chen ZY: Comparison of\nantioxidant activity and bioavailability of tea epicatechins withtheir epimers. Br J Nutr 91:873–881, 2004.38. Varnam AH, Sutherland JP: “Beverages: Technology, Chemistry\nand Microbiology.” London: Chapman & Hall, 1994.\n39. Bruneton J: “Pharmacognosie. Phytochimie. Plantes Me ´dicina-\nles.” Paris: Technique et Documentation-Lavoisier, 2001.\n40. Feng Q, Kumagai T, Torii Y, Nakamura Y, Osawa T, Uchida K:\nAnticarcinogenic antioxidants as inhibitors against intracellularoxidative stress. Free Radic Res 35:779–788, 2001.\n41. Amantana A, Santana-Rios G, Butler JA, Xu MR, Whanger PD,\nDashwood RH: Antimutagenic activity of selenium-enrichedgreen tea toward the heterocyclic amine 2-amino-3-methylimi-dazo[4,5-f] quinoline. Biol Trace Elem Res 86:177–191, 2002.\n42. Embola CW, Sohn OS, Fiala ES, Weisburger JH: Induction of\nUDP-glucuronosyltransferase 1 (UDP-GT1) gene complex bygreen tea in male F344 rats. Food Chem Toxicol 40:841–844,2002.\n43. Kondo T, Ohta T, Igura K, Hara Y, Kaji D: Tea catechins inhibit\nangiogenesis endothelial cell growth, migration in vitro , mea-\nsured by human and tube formation through inhibition of VEGFreceptor binding. Cancer Lett 180:139–144, 2002.\n44. Pan TH, Jankovic J, Le WD: Potential therapeutic properties of\ngreen tea polyphenols in Parkinson’s disease. Drugs Aging 20:711–721, 2003.\n45. Kim JH, Kang BH, Jeong JM: Antioxidant antimutagenic and\nchemopreventive activities of a phyto-extract mixture derivedfrom various vegetables, fruits and oriental herbs. Food Sci Bio-technol 12:631–638, 2003.\n46. Skrzydlewsja E, Augustyniak A, Ostrowska J, Luczaj W, Tara-\nsiuk E: Green tea protection against aging-induced oxidativestress. Free Radic Biol Med 33:555, 2002a.\n47. Cao G, Sofic E, Prior R: Antioxidant capacity of tea and common\nvegetables. J Agric Food Chem 44:3426–3431, 1996.\n48. Langley-Evans S: Antioxidant potential of green and black tea\ndetermined using the ferric reducing power (FRAP) assay. Int JFood Sci Nutr 51:181–188, 2000.\n49. Saffari Y, Sadrzadeh SMH: Green tea metabolite EGCG protects\nmembranes against oxidative damage in vitro. Life Sci 74:1513–1518, 2004.\n50. Zhang MH, Luypaert J, Pierna JAF, Xu QS, Massart DL: Deter-\nmination of total antioxidant capacity in green tea by near-infrared spectroscopy and multivariate calibration. Talanta 62:25–35, 2004.\n51. Frei B, Higdon JV: Antioxidant activity of tea polyphenols in\nvivo: Evidence from animal studies. J Nutr 133:3275–3284, 2003.\n52. Klaunig J, Xu Y, Han C, Kamendulis L, Chen J, Heiser C,\nGordon M, Mohler E: The effect of tea consumption on oxidativestress in smokers and nonsmokers. Proc Soc Exp Biol Med220:249–254, 1999.\n53. Erba D, Riso P, Bordoni A, Foti P, Biagi PL, Testolin G: Effec-\ntiveness of moderate green tea consumption on antioxidativestatus and plasma lipid profile in humans. J Nutr Biochem 16:144–149, 2005.\n54. Chung FL, Schwartz J, Herzog CR, Yang YM: Tea and cancer\nprevention: Studies in animals and humans. J Nutr 133:3268–3274, 2003.\n55. Lambert JD, Yang CS: Mechanisms of cancer prevention by tea\nconstituents. J Nutr 133:3262–3267, 2003.\n56. Mittal A, Pate MS, Wylie RC, Tollesfsbol TO, Katiyar SK:\nEGCG down regulates telomerase in human breast carcinomaGreen Tea: Beneficial Effects\nJOURNAL OF THE AMERICAN COLLEGE OF NUTRITION 95MCF-7 cells, leading to suppression of cell viability and induc-\ntion of apoptosis. Int J Oncol 24:703–710, 2004.\n57. Inoue M, Tajima K, Hirose K, Hamajima N, Takezaki T, Kuroishi\nT, Tominaga S: Tea and coffee consumption and the risk ofdigestive tract cancers: Data from a comparative case-referentstudy in Japan. Cancer Causes Control 9:209–216, 1998.\n58. Bianchi G, Cerhan J, Parker A, Putnam S, See W, Lynchi C,\nCantor K: Tea consumption and risk of bladder and kidneycancers in a population-based case-control study. Am J Epidemiol151:377–383, 2000.\n59. Yamamoto T, Hsu S, Lewis J, Wataha J, Dickinson D, Singh B,\nBollag WB, Lockwood P, Ueta E, Osaki T, Schuster G: Green teapolyphenols causes differential oxidative environments in tumorversus normal epithelial cells. J Pharmacol Exp Ther 301:230–236, 2003.\n60. Laurie SA, Miller VA, Grant SC, Kris MG: Phase I study of green\ntea extract in patients with advanced lung cancer. Cancer Che-mother Pharmacol 55:33–38, 2005.\n61. Siddiqui IA, Afaq F, Adhami VM, Ahmad N, Mukhtar H: Anti-\noxidants of the beverage tea in promotion of human health.Antioxid Redox Signal 6:571–582, 2004.\n62. D’Alessandro T, Prasain J, Benton MR, Botting N, Moore R,\nDarley-Usmar V, Patel R, Barnes S: Polyphenols, inflammatoryresponse, and cancer prevention: Chlorination of isoflavones byhuman neutrophils. J Nutr 133:3773–3777, 2003.\n63. Lin YL, Lin JK: ( /H11002)-Epigallocatechin-3-gallate blocks the induc-\ntion of nitric oxide synthase by down-regulating lipopolysaccha-ride-induced activity of transcription factor NF-kB. Mol Pharma-col 52:467–472, 1997.\n64. Chen J, Han C: The protective effect of tea on cancer: Human\nevidence. In Bidlach WR, Omaye ST, Meshin MS, Topham DK(eds): “Phytochemicals as Bioactive Agents.” Lancaster: Tech-nomic, pp 131–150, 2000.\n65. Yamamoto T, Lewis J, Wataha J, Dickinson D, Singh B, Bollag\nWB, Ueta E, Osaki T, Athar M, Schuste r G & Hsu S: Roles of\ncatalase and hydrogen peroxide in green tea polyphenol-inducedchemopreventive effects. J Pharmacol Exp Ther 308:317–323,2004.\n66. Hoshiyama Y, Kawaguchi T, Miura Y, Mizou T, Tokui N,\nYatsuya H, Sakata K, Kondo T, Kikuchi S, Toyoshima H, Hay-akawa N, Tamakoshi A, Ohno Y, Yoshimura T: A nested case-control study of stomach cancer in relation to green tea consump-tion in Japan. Br J Cancer 90:135–138, 2004.\n67. Rosengren RJ: Catechins and the treatment of breast cancer:\nPossible utility and mechanistic targets. Drugs 6:1073–1078,2003.\n68. Wu AH, Yu MC, Tseng CC, Hankin J, Pike MC: Green tea and\nrisk of breast cancer in Asian Americans. Int J Cancer 106:574–579, 2003.\n69. Nakachi K, Suemasu K, Suga K, Takeo T, Imai K, Higashi Y:\nInfluence of drinking green tea on breast cancer malignancyamong Japanese patients. Jpn J Cancer Res 89:254–261, 1998.\n70. Inoue M, Tajima K, Mizutani M, Iwata H, Iwase T, Miura S,\nHirose K, Hamajima N, Tomonaga S: Regular consumption ofgreen tea and the risk of breast cancer recurrence: follow-up studyfrom the Hospital-based Epidemiologic Research Program atAichi Cancer Center (HERPACC), Japan. Cancer Lett 167:175–182, 2001.71. Zhou JR, Yu LY, Mai ZM, Blackburn GL: Combined inhibition\nof estrogen-dependent human breast carcinoma by soy and teabioactive components in mice. Int J Cancer 108:8–14, 2004.\n72. Zhang M, Binns CV, Lee AH: Tea consumption and ovarian\ncancer risk: A case-control study in China. Cancer EpidemiolBiomarkers Prev 11:713–718, 2002.\n73. Yu NH, Yin JJ, Shen SR: Growth inhibition of prostate cancer\ncells by epigallocatechin in the presence of Cu\n2/H11001. J Agric Food\nChem 52:462–466, 2004.\n74. Jian L, Xie LP, Lee AH, Binns CW: Protective effect of green tea\nagainst prostate cancer: A case-control study in southeast China.Int J Cancer 108:130–135, 2004.\n75. Asfar S, Abdeen S, Dashti H, Khoursheed M, Al-Sayer H,\nMathew T, Al-Bader A: Effect of green tea in the prevention andreversal of fasting-induced intestinal mucosal damage. Nutrition19:536–540, 2003.\n76. Borrelli F, Capasso R, Russo A, Ernst E: Systematic review:\ngreen tea and gastrointestinal cancer risk. Aliment PharmacolTher 19:497–510, 2004.\n77. Koizumi Y, Tsubono Y, Nakaya N, Nishino Y, Shibuya D,\nMatsuoka H, Tsuji I: No association between green tea and therisk of gastric cancer: Pooled analysis of two prospective studiesin Japan. Cancer Epidemiol Biomarkers Prev 12:472–473, 2003.\n78. Sasazuki S, Inoue M, Hanaoka T, Yamamoto S, Sobue T, Tsug-\nane S: Green tea consumption and subsequent risk of gastriccancer by subsite the JPHC study. Cancer Causes Control 15:483–491, 2004.\n79. Nagano J, Kono S, Preston DL, Mabuchi K: A prospective study\nof green tea consumption and cancer incidence, Hiroshima andNagasaki (Japan). Cancer Causes Control 12:501–508, 2001.\n80. Arab L, Il’yasova D: The epidemiology of tea consumption and\ncolorectal cancer incidence. J Nutr 133:3310–3318, 2003.\n81. Negishi H, Xu JW, Ikeda K, Njelekela M, Nara Y, Yamory Y:\nBlack and green tea polyphenols attenuate blood pressure in-creases in stroke-prone spontaneously hypertensive rats. J Nutr134:38–42, 2004.\n82. Yang YC, Lu FH, Wu JS, Wu CH, Chang CJ: The protective\neffect of habitual tea consumption on hypertension. Arch InternMed 164:1534–1540, 2004.\n83. Hodgson JM, Devine A, Puddey IB, Chan SY, Beilin LJ, Prince\nRL: Tea intake is inversely related to blood pressure in olderwomen. J Nutr 133:2883–2886, 2003.\n84. Singh AK, Seth P, Anthony P, Husain MM, Madhavan S,\nMukhtar H, Maheshwari RK: Green tea constituent epigallocat-echin-3-gallate inhibits angiogenic differentiation of human en-dothelial cells. Arch Biochem Biophys 401:29–37, 2002.\n85. Murakami T, Oshato K: Dietary green tea intake preserves and\nimproves arterial compliance and endothelial function. J Am CollCardiol 41:271–274, 2003.\n86. Geleijnse J, Launer L, Hofman A, Pols H, Witteman J: Tea\nflavonoids may protect against atherosclerosis: The RotterdamStudy. Arch Intern Med 159:2170–2174, 1999.\n87. Sasazuki S, Kodama H, Yoshimasu K, Liu Y, Washio M, Tanaka\nK, Tokunaga S, Kono S, Arai H, Doy Y, Kawano T, Nakagaki O,Takada K, Koyanagi S, Hiyamuta K, Nii T, Shirai K, Ideishi M,Arakawa K, Mohri M, Takeshita A: Relation between green teaconsumption and the severity of coronary atherosclerosis amongJapanese men and women. Ann Epidemiol 10:401–408, 2000.Green Tea: Beneficial Effects\n96 VOL. 25, NO. 288. Nakachi K, Matsuyama S, Miyake S, Suganuma M, Imai K:\nPreventive effects of drinking green tea on cancer and cardiovas-cular disease: Epidemiological evidence for multiple targetingprevention. Biofactors 13:49–54, 2000.\n89. Ishikawa T, Suzukawa M, Ito T, Yoshida H, Ayaori M, Nishiwaki\nM, Yonemura A, Hara Y, Nakamura H: Effect of tea flavonoidsupplementation on the susceptibility of low-density lipoproteinto oxidative modification. Am J Clin Nutr 66:261–266, 1997.\n90. Gomikawa S, Ishikawa Y: Effects of catechins and ground green\ntea drinking on the susceptibility of plasma and LDL to theoxidation in vitro andex vivo . J Clin Biochem Nutr 32:55–68,\n2002.\n91. Trevisanato S, Kim Y: Tea and health. Nutr Rev 58:1–10, 2000.92. Raederstoff DG, Schlachter MF, Elste V, Weber P: Effect of\nEGCG on lipid absorption and plasma lipid levels in rats. J NutrBiochem 14:326–332, 2003.\n93. Yokozawa T, Nakagawa T, Kitani K: Antioxidative activity of\ngreen tea polyphenol in cholesterol-fed rats. J Agric Food Chem50:3549–3552, 2002.\n94. Hertog M, Kromhout D, Aravanis C, Blackburn H, Buzina R,\nFidanza F, Gianpaoli S, Jansen A, Menotti A, Nedeljkovic S,Pekkarinen M, Simic B, Toshima H, Feskens E, Hollman P,Katan M: Flavonoid intake and long-term risk of coronary heartdisease and cancer in the Seven Countries Study. Arch InternMed 155:381–386, 1995.\n95. Sesso H, Gaziano J, Buring J, Hennekens C: Coffee and tea intake\nand the risk of myocardial infarction. Am J Epidemiol 149:162–169, 1999.\n96. Peters U, Poole C, Arab L: Does tea affect cardiovascular dis-\nease? A meta-analysis. Am J Epidemiol 154:495–503, 2001.\n97. Hirano R, Momiyama Y, Takahashi R, Taniguchi H, Kondo K,\nNakamura H, Ohusuzu F: Comparison of green tea intake inJapanese patients with and without angiographic coronary arterydisease. Am J Cardiol 90:1150–1153, 2002.\n98. Ohmori R, Momiyama Y, Takahashi R, Taniguchi H, Nakamura\nH, Kondo K, Ohsuzu F: Inverse association of green tea intakewith myocardial infarction (MI) and its genetic variation. Ath-eroscler Suppl 4:21, 2003.\n99. Duffy SJ, Keaney Jr JF, Holbrook M, Gokce N, Swerdloff P, Frei\nB, Vita JA: Short- and long-term black tea consumption reversesendothelial dysfunction in patients with coronary artery disease.Circulation 104:151–156, 2001.\n100. Hertog M, Sweetnam P, Fehily A, Elwood P, Kromhout D:\nAntioxidant flavonols and ischemic heart disease in a Welshpopulation of men: The Caerphilly study. Am J Clin Nutr 65:1489–1494, 1997.\n101. McAnlis G, McEneny J, Pearce J, Young I: Black tea consump-\ntion does not protect low density lipoprotein from oxidativemodification. Eur J Clin Nutr 52:202–206, 1998.\n102. Elvin-Lewis M, Vitale MK, Opjas T: Anticariogenic potential of\ncommercial teas. J Prosther Dent 6:273–276, 1980.\n103. Mitscher LA, Jung M, Shankel D: Chemoprotection: a review of\nthe potential therapeutic antioxidant properties of green tea ( Ca-\nmellia sinensis ) and certain of its constituents. Med Res Rev\n17:327–332, 1997.\n104. Linke HAB, LeGeros RZ: Black tea extract and dental caries\nformation in hamsters. Int J Food Sci Nutr 54:89–95, 2003.105. Otake S, Makimura M, Kuroki T: Anticaries effects of polyphe-\nnolic compounds from Japanese green tea. Caries Res 25:438–442, 1991.\n106. Okamoto M, Sugimoto A, Legun KP, Nakayama K, Kamaguchi\nA, Maeda N: Inhibitory effect of green tea catechins on cysteineproteinases in Porphyromonas gingivalis. Oral Microbiol Immu-nol 19:118–120, 2004.\n107. Zhang J, Kashket S: Inhibition of salivary amylase by black and\ngreen teas and their effects on the intraoral hydrolysis of starch.Caries Res 32:233–236, 1998.\n108. Simpson A, Shaw L, Smith AJ: The bio-availability of fluoride\nfrom black tea. J Dent 29:15–21, 2001.\n109. Lee MJ, Lambert JD, Prabhu S, Meng XF, Lu H, Maliakal P, Ho\nCT, Yang CS: Delivery of tea polyphenols to the oral cavity bygreen tea lavels and black tea extract. Cancer Epidemiol Biomar-kers Prev 13:132–137, 2004.\n110. Elmets CA, Singh D, Tubesing K, Matsui M, Katiyar S, Mukhtar\nH: Cutaneous photoprotection from ultraviolet injury by green teapolyphenols. J Am Acad Dermatol 44:425–432, 2001.\n111. Katiyar SK: Skin photoprotection by green tea: Antioxidant and\nimmunomodulations effects. Curr Drug Targets 3:234–242, 2003.\n112. Dulloo AG, Duret C, Rohrer D, Girardier L, Mensi N, Fathi M,\nChantre P, Vandermander J: Efficacy of a green tea extract rich incatechin polyphenols and caffeine in increasing 24-h energyexpenditure and fat oxidation in humans. Am J Clin Nutr 70:1040–1045, 1999.\n113. Zheng G, Sayama K, Okubo T, Junefa LR, Oguni I: Anti-obesity\neffects of three major components of green tea, catechins, caf-feine and theanine in mice. In vivo 18:55–62, 2004.\n114. Juhel C, Armand M, Pafumi Y, Rosier C, Vandermander J,\nLarson D: Green tea extract (AR25 /H23041) inhibits lipolysis of trig-\nlycerides in gastric and duodenal medium in vitro . J Nutr Bio-\nchem 11:45–51, 2000.\n115. Chantre P, Lairon D: Recent findings of green tea extract AR25 /H23041\n(exolise) and its activity for the treatment of obesity. Phytomedi-cine 9:3–8, 2002.\n116. Tian WX, Li LC, Wu XD, Chen CC: Weight reduction by\nChinese medicinal herbs may be related to inhibition of fatty acidsynthase. Life Sci 74:2389–2399, 2004.\n117. Dulloo AG, Seydoux J, Girardier L, Chantre P, Vandermander J:\nGreen tea and thermogenesis: interactions between catechin-polyphenols, caffeine and sympathetic activity. Int J Obes RelatMetab Disord 24:252–258, 2000.\n118. Kovacs EM, Lejeune MP, Nijs I, Westerterp-Plantenga MS:\nEffects of green tea on weight maintenance after body-weightloss. Br J Nutr 91:431–437, 2004.\n119. Wu CH, Lu FH, Chang CS, Chang TC, Wang RH, Chang CJ:\nRelationship among habitual tea consumption, percent body fat,and body fat distribution. Obes Res 11:1088–1095, 2003a.\n120. Anderson RA, Polansky MM: Tea enhances insulin activity. J\nAgric Food Chem 50:7182–7186, 2002.\n121. Wu LY, Juan CC, Hsu YP, Hwang LS: Effect of tea green\nsupplementation on insulin sensitivity in Sprague-Dawley rats. JAgric Food Chem 52:643–648, 2004.\n122. Takabayashi F, Harada N, Yamada M, Murohisa B, Oguni I:\nInhibitory effect of green tea catechins in combination withsucralfate on Helicobacter pylori infection in Mongolian gerbils.\nJ Gastroenterol 39:61–63, 2004.Green Tea: Beneficial Effects\nJOURNAL OF THE AMERICAN COLLEGE OF NUTRITION 97123. Yee YK, Koo MWL, Szeto ML: Chinese tea consumption and\nlower risk of Helicobacter infection. J Gastroenterol Hepatol17:552–555, 2002.\n124. Toda M, Okubo S, Ohnishi R, Shimamura T: Antibacterial and\nbactericidal activities of Japanese green tea. J Nippon Med Sch44:669–672, 1989.\n125. Mukoyama A, Ushijima H, Nishimura S, Koike H, Toda M, Hara\nY, Shimamura T: Inhibition of rotavirus and enterovirus infec-tions by tea extracts. Jpn J Med Sci Biol 44:181–186, 1991.\n126. Yam TS, Shah S, Hamilton-Miller JM: Microbiological activity\nof whole and fractionated crude extracts of tea ( Camellia sinen-\nsis), and of tea components. FEMS Microbiol Lett 152:169–174,\n1997.\n127. Weber JM, Ruzindana-Umunyana A, Sicar S, Cowan J: Adeno-\nvirus infection is inhibited in vitro by green tea catechins. J Clin\nVirol 28:S91, 2003.\n128. Hirasawa M, Takada K: Multiple effects of green tea catechin on\nthe antifungal activity of antimycotics against Candida albicans .\nJ Antimicrob Chemother 53:225–229, 2004.\n129. Muraki S, Yamamoto S, Ishibashi H, Horiuchi T, Hosoi T, Suzuki\nT, Orimo H, Nakamura K: Green tea drinking is associated withincreased bone mineral density. J Bone Miner Res 18:S241–S241, 2003.\n130. Park H, Ko S, Kim J, Kim S: Effects of green tea extracts and\npolyphenols on the proliferation and activity of bone cells. J Bone\nMiner Res 18:S342, 2003.\n131. Dorchies OM, Wagner S, Waldhauser KM, Buetler TM, Ruegg\nUT: Anti-fibrotic properties of green tea catechins on mousemuscle cell cultures. Neuromuscul Disord 13:639, 2003.\n132. Sakata R, Ueno T, Nakamura T, Sakamoto M, Torimura T, Sata\nM: Green tea polyphenols epigallocatechin-3-gallate inhibitsplatelet-derived growth factor-induced proliferation of humanhepatic stellate cell line LI90. J Hepatol 40:52–59, 2004.\n133. Bayer J, Gomer A, Demir Y, Amano H, Kish DD, Fairchild PS,\nHeeger PP: Effects of green tea polyphenols on murine trans-plant-reactive T cell immunity. Clin Immunol 110:100–108,2004.\n134. Kakuda T: Neuroprotective effects of the tea components thean-\nine and catechins. Biol Pharm Bull 25:1513–1518, 2002.\n135. Dajas F, Rivera F, Blasina F, Arredondo F, Echeverri C, Lafon L,\nMorkio A, Heizen H: Cell cultura protection and in vivo neuro-\nprotective capacity of flavonoids. Neurotox Res 5:425–432, 2003.\n136. Weinreb O, Mandel S, Amit T, Youdim MB: Neurological mech-\nanisms of green tea polyphenols in Alzheimer’s and Parkinson’sdiseases. J Nutr Biochem 15:506–516, 2004.\n137. Sagesaka-Mitane Y, Miwa M, Okada S: Platelet aggregation\ninhibitors in middle-aged Japanese men and women. Ann Epide-miol 7:280–284, 1997.\n138. Dvorakova K, Dorr RT, Valcies S, Timmermann B, Alberts DS:\nPharmacokinetics of the green tea derivative, EGCG, by thetopical route of administration in mouse and human skin. CancerChemother Pharmacol 43:331–335, 1999.\n139. Ishizuk H, Eguchi H, Oda T, Ogawa S, Nakagawa K, Honjo S,\nKono S: Relation of coffee, green tea, and caffeine intake togallstone disease in middle-age Japanese men. Eur J Epidemiol18:401–405, 2003.\n140. Thiagarajan G, Chandani S, Sundari CS, Rao SH, Kulkarni AV,Balasubramanian D: Antioxidant properties of green and black\ntea, and their potential ability to retard the progression of eye lenscataract. Exp Eye Res 73:393–401, 2001.\n141. Gupta SK, Halder N, Srivastava S, Trivedi D, Joshi S, Varma SD:\nGreen tea ( Camellia sinensis ) protects against selenite-induced\noxidative stress in experimental cataractogenesis. OphthalmicRes 34:258–263, 2002.\n142. Skrzydlewska E, Ostrowska J, Stankiewicz A, Farbiszewski R:\nGreen tea as a potent antioxidant in alcohol intoxication. AddictBiol 7:307–314, 2002b.\n143. Ferrari CKB, Torres EAFS: Biochemical pharmacology of func-\ntional foods and prevention of chronic diseases of aging. BiomedPharmacother 57:251–260, 2003.\n144. Arburjai T, Natsheh FM: Plants used in cosmetics. Phytother Res\n17:987–1000, 2003.\n145. Powell JJ, Burden TJ, Thompson RP: In vitro mineral availability\nfrom digested tea: a rich dietary source of manganese. Analyst123:1721–1724, 1998.\n146. Mann J, Truswell AS: “Essentials of Human Nutrition.” New\nYork: Oxford University Press, 1998.\n147. Shils ME, Olson JA, Shike M: “Modern Nutrition in Health and\nDisease.” Malvern: Lea and Febiger, 1994.\n148. Garcı ´a E, Cabrera C, Lorenzo ML, Sa ´nchez J, Lo ´pez MC: Daily\ndietary intake of chromium in southern Spain measured withduplicate diet sampling. Br J Nutr 86:391–396, 2001.\n149. Fennema OR: “Food Chemistry.” New York: Dekker, 2000.150. Younger KM: Dietary Reference Standards. In Gibney MJ, Vor-\nster HH, Kok FJ (eds): “Introduction to Human Nutrition.” Ox-ford: Blackwell Science, pp 116–124, 2002.\n151. Institute of Medicine: “Dietary Reference Intakes for Vitamin C,\nVitamin E, Selenium and Carotenoids.” Washington: NationalAcademy Press, 2000.\n152. Institute of Medicine: “Dietary Reference Intakes for Vitamin A,\nVitamin K, Arsenic, Boron, Chromium, Copper, Iodine, Iron,Manganese, Molybdenum, Nickel, Silicon, Vanadium and Zinc.”Washington: National Academy Press, 2002.\n153. Hasegawa N, Niimi N, Odani F: Vitamin C is one of the lipolytic\nsubstances in green tea. Phytother Res 16:91–92, 2002.\n154. Shimada K, Takahashi M, Haji A, Kaminohara M, Matsuda N,\nNomura A, Sawano E, Saeki K: Changes in contents and extract-abilities of some ingredients in tea leaves during manufacturingprocess of green tea (sencha). J Jpn Soc Food Sci 43:695–702,1996.\n155. Garcı ´a-Closas R, Berenguer A, Tormo JM, Sa ´nchez MJ, Quiros\nJR, Navarro C, Arnaud R, Dorronsoro M, Chirlaque MD, Barri-carte A, Ardanaz E, Amiano P, Martı ´nez C, Agudo A, Gonza ´lez\nCA: Dietary sources of vitamin C, vitamin E and specific caro-tenoids in Spain. Br J Nutr 91:1005–1011, 2004.\n156. Pulido R, Herna ´ndez-Garcı ´a M, Saura-Calixto F: Contribution\nof beverages to the intake of lipophilic and hydrophilic anti-oxidants in the Spanish diet. European J Clin Nutr 57:1275–1282, 2003.\n157. Fisher C, Scott TR: “Food Flavours. Biology and Chemistry.”\nCambridge: The Royal Society of the Chemistry, 1997.\n158. Lo ´pez FF, Cabrera C, Lorenzo ML, Lo ´pez MC: Aluminum con-\ntent in foods and beverages consumed in the Spanish diet. J FoodSci 65:206–210, 2000.Green Tea: Beneficial Effects\n98 VOL. 25, NO. 2159. Minoia C, Sabbioni E, Ronchi A, Gatti A: Trace element refer-\nence values in tissues from inhabitants of the European Commu-nity. IV. Influence of dietary factors. Sci Total Environ 141:181–195, 1994.\n160. Massey RC, Taylor D: “Aluminum in Food and the Environ-\nment.” London: Royal Society of Chemistry, 1991.\n161. Flaten TP: Aluminum in tea concentrations, speciation and bio-\navailability. Coordin Chem Rev 228:385–395, 2002.\n162. Tuntawiroon M: Dose-dependent inhibitory effect of phenolic\ncompounds in foods on non-heme iron absorption in men. Am JClin Nutr 53:554–557, 1991.\n163. Hurrell RF: “Prospects for improving the iron fortification of\nfoods.” In Fomon S, Zlotkin S (eds): “Nutricional anemias.” NewYork: Raven Press, pp 193–208, 1992.\n164. Hamdaoui MH, Chabchob S, Heidhili A: Iron bioavailability and\nweight gains to iron-deficient rats fed a commonly consumedTunisian meal “bean seeds ragout” with or without beef and withgreen or black tea decoction. J Trace Elem Med Biol 17:159–164,2003.\n165. Al-Othaimeen A, Osman A, Al-Orf S: Prevalence of nutritional\nanaemia among primary school girls in Riyadh City, Saudi Ara-bia. Int J Food Sci Nutr 50:237–243, 1999.\n166. Gibson S: Iron intake and iron status of preschool children:\nAssociations with breakfast cereals, vitamin C and meat. PublicHealth Nutr 2:521–528, 1999.\n167. Belitz DH, Grosch W: “Quı ´mica de los Alimentos.” Zaragoza:\nAcribia, 1997.\n168. Suzuki Y, Tsubono Y, Nakaya N, Suzuki Y, Koizumi Y, Tsuji I:\nGreen tea and the risk of breast cancer: pooled analysis of twoprospective studies in Japan. Br J Cancer 90:1361–1363, 2004.\n169. Huang X, Tajima K, Hamajima N, Inoue M, Takezaki T, Kuroishi\nT, Hirose K, Tominaga S, Xiang J, Tokudome S: Effect of lifestyles on the risk of subsite-specific gastric cancer in those withand without family history. J Epidemiol 9:40–45, 1999.\n170. Shibata K, Moriyama M, Fukushima T, Kaetsu A, Miyazaki M,\nUne E: Green tea consumption and chronic atrophic gastritis: across-sectional study in a green tea production village. J Epide-miol 10:310–316, 2000.\n171. Kuwahara Y, Kono S, Eguchi H, Hamada H, Shinchi K, ImanishiK: Relationship between serologically diagnosed chronic atrophic\ngastritis, Helicobacter pylori, and environmental factors in Japa-nese men. Scand J Gastroenterol 35:476–481, 2000.\n172. Setiawan VW, Zhang ZF, Yu GP: Protective effect of green tea\non the risk of chronic gastritis and stomach cancer. Int J Cancer92:600–604, 2001.\n173. Tsubono Y, Nishino Y, Komatsu S, Hsieh C, Kanemura S, Tsuji\nI, Nakatsuka H, Fukao A, Satoh H, Hisamichi S: Green tea andthe risk of gastric cancer in Japan. New Engl J Med 344:632–636,2001.\n174. Hoshiyama Y, Kawaguchi T, Miura Y, Mizoue T, Tokui N,\nYatsuya H, Sakata K, Kondo T, Kikuchi S, Toyoshima H, Hay-akawa N, Tamakoshi A, Ohno Y, Yoshimura T: A prospectivestudy of stomach cancer death in relation to green tea consump-tion in Japan. Br J Cancer 87:309–313, 2002.\n175. Fujino Y, Tamakoshi A, Ohno Y, Mizoue T, Tokui N, Yoshimura\nT: Prospective study of education background and stomach can-cer in Japan. Prev Med 35:121–127, 2002.\n176. Wang LD, Zhou Q, Feng CW, Liu B, Qi YJ, Zhang YR, Gao SS,\nFan FM, Zhou Y, Yang CS, Wei JP, Zheng S: Intervention andfollow-up on human esophageal precancerous lesion in Henen,northern China, a high-incidence area for esophageal cancer. GanTo Kagaku Ryoho 29:159–172, 2002.\n177. Nagano J, Kono S, Preston DL, Mabuchi K: Bladder-cancer\nincidence in relation to vegetable and fruit consumption: a pro-spective study of atomic-bomb survivors. Int J Cancer 86:132–138, 2000.\n178. Zhong L, Golberg MS, Gao YT, Hanley JA, Parent ME, Jin F: A\npopulation-based case-control study of lung cancer and green teaconsumption among women living in Shanghai, China. Epidemi-ology 12:695–700, 2001.\n179. Yoshida M, Kimura Y, Abe M, Ando T, Tachi H, Fukunaga K:\nQuantitative evaluation of selenium contained in tea by highperformance liquid chromatography. Nutr Sci Vitaminol 47:248–252, 2001.\nReceived March 18, 2005; revision accepted December 20,\n2005.Green Tea: Beneficial Effects\nJOURNAL OF THE AMERICAN COLLEGE OF NUTRITION 99\nView publication stats"
}