{
    "filename": "Healthy properties of green and white teas an update.pdf",
    "type": "pdf",
    "title": null,
    "authors": "Marta",
    "lastmodifiedtime": "D:20181204083145+01'00'",
    "text": "Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 1 \n Healthy properties of green and white teas: an update  \n \nS. Pastoriza,a M. Mesías,b C. Cabrera†a and J. A. Ru fián-Henares *a,c \n \naDepartamento de Nutrición y Bromatología, Facultad de Farmacia, Campus de  Cartuja S/N, 18071, \nUniversidad de Granada, Granada, Spa in \nbInstituto de Ciencia y Tecnología de Alimentos y Nutrición (ICTAN -CSIC),  José Antonio Novais 10, \n28040 Madrid, Spain  \ncInstituto de Investigación Biosanitaria ibs.GRANADA, Universidad de Granada,  Granada, Spain. E -mail: \njarufian@ugr.es; Fax: +34 958 24 95 77;  Tel: +34 958 24 07 49  \n \nABSTRACT  \nGreen tea has been consumed for centuries in Japan, China and Morocco. White tea, which is \nconsidered  a variety of green tea, is mostly consumed in China and is very appreciated for its flavor. \nCurrently the  consumpti on of both types of tea has been extended to the western countries even as a \nfunctional  ingredient. A group of polyphenols called catechins stands out among their bioactive \ncomponents, the  most abundant being the ( −) epigallocatechin gallate, with high antioxidant power. Teas \nalso contain  other phenolic compounds such as gallic, ca ffeic, chlorogenic or cinnamic acids, quercetin \nand proanthocyanidols, ca ffeine, theophylline, L -theanine and minerals such as fluorine, manganese or  \nchromium. Investigations have mainly been focused on their antioxidant potential and their implication in  \nthe prevention and treatment of degenerative diseases. Several studies have evaluated their role in \ncardiovascular  diseases, body weight control, bone mass increase, protection against neurodegenerative  \ndiseases and improvement of type 2 diabetes, among other pathologies. The main points of controversy  \nare the design and interpretation of epidemiological and human intervention studies and t he lack of \ninformation  on catechins availability, metabolism and biotransformation. This review compiles and \nanalyzes  the latest peer -reviewed papers published from 2002 up to February 2017, including systematic \nreviews  and meta -analyses.  \n \n1. INTRODUCTION  \nTea is the most consumed beverage in the world after water  and is highly valued for its taste and aroma, \nits health benefits  and for diverse socio -cultural reasons.1 It is obtained by infusion  of leaves and shoots \nof the species Camellia sinensis var. sinensis. The tea bush is cultivated in more than 45 countries. About \n3 billion kilograms of tea are produced and consumed  annually1 worldwide and the largest tea producing \ncountries  are China, Japan, Taiwan, Indonesia, Thailand, Sri Lanka,  Vietnam, Turkey, Ke nya and Russia. \nDepending on the processing  of the leaf, various types of tea are obtained, such as black  tea, Oolong \ntea, green tea and white tea.1 –3 In black tea, leaves  are fermented through oxidation by \npolyphenoloxidase  enzymes. In Oolong tea, leaves are subjected to a partial fermentation  process. In \ngreen tea, the process of fermentation is  avoided by the inactivation of the enzymes through a slight  \nthermal treatment.4 Although there is no consensus on the  definition, white tea is considered a green \ntea variety produced  in very specific places, mainly in Fujian Province (China).5  White tea is made \nentirely from leaf buds that are covered with  downy and white hairs, from which its name is derived. \nThe first leaves and buds are selected and subjected to  a minimum  processing by simple drying. White \ntea is highly valued for its  organoleptic characteristics, as it provides an infusion with a  soft and aromatic \nflavor and with floral and fruit notes.2,3  Some authors point out that white tea has less ca ffeine and \nmore antioxidant compounds than green tea.2,5 However,  other authors have argued that the \ncomposition of both  caffeine and antioxidants, defined as the index between total  catechins/polyphenols, \nis not a criterion of di fferentiation  between green tea a nd white tea.2,3,6 The variability in the  content \nof polyphenols and, therefore, in catechins, may be  associated with factors such as growing conditions, \nclimatology,  processing, etc7,8 and even the conditions which the infusion  is prepared under.9  \n \n1.1. C omposition of tea leaves  Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 2 \n Tea leaves are mainly composed of: (1) proteins (15 –20% of the  total referred to dry matter), where the \nmajor fraction is  enzymes (polyphenoloxidases and lipoxygenase).1 (2) Free  amino acids (1 –4% of the \ndry matter), where around 5 0% is L-theanine ( N-ethyl-L-glutamine), which is a relevant compound  in the \nflavor and health properties of green and white  teas.6 It is a non -proteinogenic amino acid, derived from \nglutamate,  which appears only in a very small number of plants,  including tea. It also contains glutamic \nacid, tryptophan,  glycine, serine, tyrosine, arginine or lysine, among others.  Among these amino acids, \nvaline, phenylalanine, proline,  leucine, isoleucine, tryptophan, threonine, lysine, histidine,  arginine and \ntyrosine are found in a higher content in white  tea when compared with green tea. By contrast, levels of \ntheanine,  glutamic acid, glutamine and aspartic acid are higher in  green tea and lower in white tea.10 (3) \nCarbohydrates (5 –7% of the dry matter) with polysaccharid es such as cellulose,  hemicellulose, pectins, \nglucose, sucrose, arabinose or ribose.1  (4) Lipids, present in a very low amount as glycerophospholipids,  \ntriterpene alcohols, fatty acids and sterols. (5) Vitamins, predominantly  vitamin C and some of group B.  \n(6) Xanthic bases,  including ca ffeine and theophylline and theobromine at a very  low concentration.5 \nTea leaves contain about 2 –5% ca ffeine.11  The content of ca ffeine in the infusion of green tea is \napproximately  15–25 mg per 150 mL.12 This content is app roximately  15% lower in white tea,13 \nalthough it could be influenced by  the brewing time, leaf size and water temperature. In general,  tea \ninfusions from tea in bags, where leaves are quite crushed,  contain a higher amount of ca ffeine than \nthose from tea  leaves.12 (7) Phenolic compounds (26% of the dry extract of  green tea). (8) Minerals, \nincluding fluorine, manganese,  copper and chromium.5,13 –18 Tables 1 and 2 include data  about the \ncontent of some minerals in leaves and infusions of  green tea and white te a, respectively. (9) Other \ncompounds,  such as heterosides of terpene alcohols, pigments (chlorophyll  and carotenoids), and aroma \ncompounds ( i.e. 2-hexenal,  3-hexenol, linalool, geraniol, etc.). \n \nIn black tea, the oxidation process by the polyphenoloxidase  enzyme causes remarkable changes in the \nchemical composition of the leaf.1 These changes include oxidation of  phenolic compounds, which \nresults in oxidized compounds  such as theaflavins and thearubigins, enzymatic hydrolysis of  proteins, \noxidative deaminat ion of amino acids, oxidation of  lipids and carotenoids, degradation of chlorophyll, \nrelease of  caffeine, loss of vitamin C or changes in sensory attributes  such as brown -dark color, more \nmarked empyreumatic aroma  and more bitter taste.2 These negative cha nges are not produced  in green \ntea and white tea and, therefore, the content of  bioactive compounds in both types of tea is higher than \nin black tea and, consequently, their beneficial e ffects on health  are more remarkable.  \n \n1.2. Content of phenolic compou nds \nPolyphenols are the most relevant family of phytochemicals in  terms of beneficial e ffects on human \nhealth.19 Among them,  flavonoids constitute a very extensive group and are distributed  in a great \nvariety of vegetables. They have a common basic  structu re of (C6 –C3–C6) diphenylpropane, which \nusually forms  an oxygenated heterocycle. Flavonoids are usually bound to  sugars (glycosides) and for \nthat reason they tend to be watersoluble.  Green and white tea are especially rich in flavonoids,  \nspecifically catec hins.12 In this line, the consumption of green  tea is considered the main source of \ncatechins in the diet.20 –22 The content of phenolic acids (gallic acid, benzoic acid, cinnamic  acid, \nchlorogenic acid, ca ffeic acid), gallic esters of  glucose (gallic tanni ns), quercetin and proanthocyanidols is  \nalso highlighted.11,21,22 Total polyphenols range between  10.60 –25.95 g per 100 g in white tea and \nbetween 13.7 –24.7 g  per 100 g in green tea.2,23,24  \n \nThe most abundant catechins in green and white teas are  (−) epiga llocatechin gallate (EGCG), \nrepresenting approximately  59% of the total catechins; ( −) epigallocatechin (EGC),  which accounts for \n19%, (−) epicatechin gallate (ECG) in a proportion  close to 13% and ( −) epicatechin (EC), around 6% of  \nthe total.12,25,26 Acco rding to Hilal and Engelhardt2 and  Carloni et al.13 the catechin content in tea \nranges from 9.89 to  17.00 g per 100 g in green tea, from 7.94 to 16.56 g per 100 g  in white tea and from \n0.74 to 10.00 g per 100 g in black tea.  The catechin content is consist ent with the fermentation  degree, Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 3 \n since black, white and green teas are fully, slightly and  non-fermented, respectively.10 Levels from 2.76 \nto 9.34 g per  100 g for catechins in white tea have also been reported.24  Regarding EGCG, the amounts \nchange between  4.40–9.60 g  per 100 g in green tea and between 5.23 –9.49 g per 100 g in  white tea. \nCabrera et al.14 observed that the content of EGCG  in green tea leaves was higher than 80 mg g −1, \nwhereas in  black tea it did not exceed 30 mg g −1. Wu and Wei27 reported  that one cup of green tea \n(2.5 g tea leaves per 200 mL water)  may contain 90 mg of EGCG and Johnson et al.28 estimated  that the \ndaily intake of 3 –5 cups of green tea (720 –1200 mL)  could provide up to 250 mg of catechins.   \n \nDue to the beneficial properties of  the phenolic compounds  and their high content in tea, tea extracts \nobtained from the  soluble fraction of the unfermented leaves are widely used as  an ingredient in food \nand cosmetics. Commercial extracts contain di fferent amounts of polyphenols, where abo ut 80%  may be \nrepresented by catechins and more than 45% by  EGCG. EGCG has an activity against reactive oxygen \nspecies  quite superior to vitamins C and E,29 which justifies the high  antioxidant capacity associated \nwith tea.  \n \nThe more intact the leaves appe ar, the greater is the flavonoid  content. This content decreases with the \nmanipulation of  the leaves, as in powdered tea or during the deca ffeination  process.12 In addition, the \ninfluence of infusion conditions on  the catechin content is significant. There by, using almost  boiling water \n(98 °C) and an infusion time of 7 minutes leads  to a high extraction of catechins and polyphenols and, \nconsequently,  to a high total antioxidant capacity.30 Moreover,  optimal sensorial characteristics are \nachieved under these  conditions,  while longer infusion times provide bitter taste and  excessive \nastringency.31  \n \n2. BENE FICIAL E FFECTS OF WHITE AND  GREEN TEA CONSUMPTIO N \nRecent studies have revealed that green and white teas have  positive biological activities against chronic \ndiseases such as  cancer, metabolic syndrome, type 2 diabetes, cardiovascular  and neurodegenerative \npathologies, among others. These protective  properties are related to the potent antioxidant and  anti-\ninflammatory activities of xanthic bases (ca ffeine and  theophylline), essential oils (green tea and white tea \nare the  two types of tea with the highest content), minerals (F, Mn,  Cr), L -theanine and, mostly, \ncatechins and other phenolic  compounds.12,32  \n \nCaffeine acts on the central nervous system by stimulatin g attention, facilitating the association of ideas \nand reducing the  sensation of fatigue. Some of the e ffects caused by ca ffeine are  influenced by the \ncontent of theophylline, which also has inotrope,  vasodilator, diuretic and bronchodilator action.12,25  \nEssential oils, which are abundant in green tea and white tea,  facilitate digestion.12 Catechins and in \nparticular EGCG have  low bioavailability when orally ingested.33 Only a small percentage  is absorbed at \nthe level of the small intestine and passes  into the bloodstream, reaching maximum plasma \nconcentrations  between 1 –3 hours after consumption. Some authors  indicate that the secondary \nmetabolites derived from the  intake of flavonoids could be detected in blood and urine. For  that reason, \nit is thought tha t the observed biological e ffects are possibly due to these secondary metabolites rather \nthan the flavonoids themselves, which are detected in their original  form in very low quantities.34 The \nbioavailability of phenolic  tea compounds has been extensively reviewed by Lambert  et al. ,35 who \npointed out the need to expand in vivo studies to  better confirm the physiological e ffects of green and \nwhite tea  consumption. However, whatever their bioavailability, there  are many scientific reports \nrelating the antioxi dant and antiinflammatory  effects of EGCG to its ability to modulate mitochondrial  \nfunctions, impacting mitochondrial biogenesis,  bioenergetic control, etc.36 \n \n2.1. Antioxidant activity  \nOxidative stress is considered a biochemical imbalance caused  by exces sive production of reactive \noxygen species, or by a  decrease in oxidizing systems. It is related to aging and promotes  the presence Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 4 \n or complications of diseases such as atherosclerosis,  diabetes mellitus, Alzheimer ’s disease or various  \ntypes of cancer, as well as inflammatory processes and ischemia/perfusion. Among the properties of \ncatechins, their antioxidant  capacity and high potential against oxidative stress are  highlighted.36 This \nfact explains their antidiabetic, anticancer  and antiatherogenic action s. The molecular mechanisms, by  \nwhich this protective action is achieved, are not precisely  known. However, it has been suggested that \ncatechins may be  involved in the insulin signaling pathway, regulation of various  transcription factors, \ninhibition of pr ooxidant enzymes  such as nitric oxide synthetase, lipoxygenase, cyclooxygenase  and \nxanthine oxidase, metal chelation such as Fe and Cu  involved in oxidative processes and induction of \nantioxidant  enzymes such as glutathione S -transferase and superoxide  dismutase.12,37 –42 In this way, \nconsuming white tea increases  the expression of genes related to antioxidant capacity such as  Nrf2, Gst, \nNqo1 and Ho1.41,43 Catechins protect against cell  damage caused by free radicals at the level of \nproteins, lipids  and DNA. 2,14 Diseases such as cancer or cardiovascular disorders  are thought to be \nproduced or aggravated by free radicals  in a similar way to premature cell aging. Following the  most \nrecent research, Table 3 describes the main biological  effects attributed to cat echins, and especially to \nEGCG, which  are present in green and white teas.  \n \nSeveral studies have shown that the antioxidant capacity of  green tea is higher than that of other types \nof tea and other  plant products. Using the FRAP (Ferric Reducing Ability of  Plasma) method, the total \nantioxidant capacity (TAC) of green  tea is greater than that of black tea (38 and 17 μM trolox per g  tea \nper L infusion, respectively).44 Gorjanovic et al. 22 determined  the TAC in green, white, black and \nOolong tea infusions  applying the DPPH (1,1 -diphenyl -2-picrylhydrazyl) method,  showing values of 4.80 \n± 0.40, 3.66 ± 0.26, 4.45 ± 0.57 an d 3.88  ± 0.06 mM trolox per L, respectively. In addition, according to  \nthe Oxygen Radical Absorbance Capacity (ORAC) method, the  TAC of green tea45 is higher than that \nof other vegetables such  as garlic, spinach and Brussel sprouts (Table 4). In this line,  Carlsen et al.46 \ncollected data on TAC measured by the FRAP  method in more than 3100 foods, beverages, spices, \nherbs and  food supplements consumed worldwide. This study proved  that the infusion of unfermented \ntea leaves had higher TAC  values than other pr oducts such as orange, grape or tomato  juice. Gorjanovic \net al.22 indicated that the antioxidant capacity  of the characteristic compounds of green tea and white \ntea, determined by the polarographic method, ranges in the following  order: EGCG > ECG > EGC > \ngallic acid > EC > ca ffeine.  \n \nAccording to some human intervention studies, a moderate  consumption of green tea (1 –6 cups per \nday) increases the  total antioxidant capacity of the plasma and, therefore,  promotes a greater protection \nof the organism against  the oxidative damage caused by free radicals.10,47 For this reason,  including the \nconsumption of green or white tea in the usual  diet has been recommended.10,12,48 Biomarkers of the \noxidative  status have also shown to decrease with a regular  consumption o f green tea and \nmicroencapsulated extracts over  a period of 1 –4 weeks.12 However, it is important to emphasize  that  \nfor the e ffects to be expressed, tea should be consumed as  an additional component of a balanced diet \nin addition to a  healthy lifestyle.  \n \nAlmajano et al.8 observed a neuroprotective e ffect of white  tea in a study with cell cultures. Results \nshowed a reduction of  the oxidative stress associated with brain damage. This e ffect was attributed to \nthe content of catechins and other flavonols.  Oxidative stress as a result of the production of reactive \noxygen  species (ROS) is known to be an important factor in aging and  neurodegenerative disorders such \nas Alzheimer ’s, Parkinson ’s or Huntington ’s disease.49  \n \n2.2. E ffects on stress  \nAlthough green tea c ontains ca ffeine, its consumption produces  a noticeable relaxation e ffect, which is \nattributed to the  presence of catechins, or L -theanine or both compounds.1,50  Furase et al.25 indicated \nthat EGCG has sedative and hypnotic  effects at the brain level, by a cting partially at the level of GABA  Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 5 \n receptors moderating the response to acute stress. In addition,  a positive e ffect against anxiety in mice \nhas been  observed.1,51,52 The sedative e ffect is enhanced by the presence  of L-theanine. This amino \nacid is consi dered as a neuroprotective  agent that reduces psychological and physiological  stress.53 –55 \nHowever, the consumption of green tea does not  induce sleep due to the ca ffeine content, which \nproduces the  opposite e ffect, stimulating the central nervous system a nd promoting wakefulness.56 \nEffects attributed to L -theanine also  include promoting the secretion and functions of certain \nneurotransmitters  in the central nervous system.1 For all these  reasons, the consumption of green tea \nmay be advisable in  certain dis eases associated with stress and anxiety.25  \n \n2.3. Anti -mutagenic and anticancer activity  \nAnticancer e ffects of green tea have been demonstrated in  numerous studies with various cell lines, \nshowing an inhibition  of cell growth and an induction of apoptosis by catechins.  23,37,47 Catechins \npossess antimutagenic activity, avoiding  the formation of mutagens ( i.e., nitrosamines) or preventing  the \nexpression of mutagenicity ( i.e., polycyclic aromatic  hydrocarbons).57 García -Rodríguez et al. 58 \nobserved that mice consuming green tea presented reduced genotoxic damage  induced by metallic \ncompounds, such as Cr(VI) compounds.  This fact suggests a chemo -preventive e ffect of its antioxidant  \ncomponents. On the other hand, EGCG has been found to  block urokinase, an enzyme that seems to be \ninvolved in the  proliferation and di ffusion of tumors.39,40,59,60   \n \nIn cell cultures and in experimental animals, EGCG has  been shown to protect against carcinogenic \nprocesses induced  in different organs, such as skin, lung, stomach, pancr eas, duodenum, colon, prostate \nand also in breast cancer.39,61 –63 This protection has been associated with increased apoptosis  or \nprogrammed cell death, which is a key strategy for the  removal of neoplastic cells. The protective e ffect \nalso includes  a decr ease in cellular proliferation, its antioxidant and antiinflammatory  activities, the \nspecific induction of detoxifying  enzymes and a selective e ffect on the intestinal microbiota  that \nfacilitates its development.38,39,62,64 In addition, ECGC  seems to have an anti -angiogenic e ffect since it \nprevents the  growth of blood vessels in tumors.65  \n \nSeveral epidemiological studies carried out in countries  with a high tea consumption, such as Japan or \nChina, suggest  that green tea may have a protective e ffect against certain types  of cancer. However, the \nresults obtained require further investigation  since they are not conclusive.63,66,67 In this sense,  breast \ncancer has been shown significantly less frequent in  Asian women with high soybean and green tea \nconsumption.  It suggests that soybean phytochemical compounds may  potentiate the inhibitory e ffect of \ngreen tea on the progression  of breast cancer.68  \n \nCurrently, the chemoprevention of cancer through the use  of natural components of diet has acquired \ngreat interest. I n this respect, polyphenols ingested through foods and beverages  seem to have very \npromising e ffects, although the  mechanisms of action are still not well established. Singh  et al. 69 \nindicated that EGCG has high potential in cancer prevention  with the adva ntages of being a safe, low -\ncost and bioavailable  non-toxic natural agent. These authors consider that  it could be used alone or in \ncombination with other treatments,  in the prevention and treatment of tumor processes.  Traditional \npharmacological treatment s can often destroy  cancer cells and some healthy cells. However, EGCG \nseems to  act selectively on the damaged cells.  \n \n2.4. E ffect on blood pressure and cardiovascular risk  \nThe consumption of green tea has been associated with the  protection against stroke , hypertension and \natherosclerosis,  due to its antithrombotic and anti -inflammatory e ffects, among other reasons.70,71 It \ndecreases blood levels of total  cholesterol, LDL -c and its oxidation. The explanation is very  complex and \nmost studies are focused on the role of EGCG on  the lipid profile.72,73 Epidemiological and \nobservational  studies in humans suggest that a regular consumption of  green tea may be associated with Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 6 \n a lower cardiovascular  risk.21,71,73 Green tea has been demonstrated to decrease the  micellar \nsolubility of cholesterol at the intestinal level, reducing  then its absorption. At the same time, it \nimproves endothelial  function, protects LDL from oxidation, increases high  density  lipoprotein levels \n(HDL) and increases the total antioxidant  capacit y of plasma.48,74,76 On the other hand, gallic  acid, \npresent in remarkable amounts in tea leaves, can interact  with the function of P -selectin, an adhesion \nmolecule involved  in atherothrombosis which mediates the interactions between  leukocyte –\nendothelium,  leukocyte –platelet and platelet –platelets.  70 Studies in humans have shown that the oral \nintake of  green tea extracts with a high catechin content increases the  resistance of plasma LDL to \noxidation.39 As the main strategies  for modifying the blood lipid profile include medication, lifestyle  \nmodification and consumption of certain plant products,  green tea and white tea consumptions are \noptions which  should be considered and may provide interesting avenues for  future research.  \n \nStudies with experimental ani mals have evaluated the e ffects of the administration of catechin \nconcentrates equivalent to the  content of 8 –10 cups of green tea. Catechins seem to inhibit the  action \nof the enzyme that converts angiotensin I into angiotensin  II, a potent vasoconstrictor , and therefore its \naction is suppressed.  However, it is also indicated that the ca ffeine content  of green tea, although low, \nmay counter the e ffect of catechins  since it could raise the blood pressure.12 Most studies with  \nexperimental animals have observe d that green tea catechins  decrease the blood pressure.70 Yang et \nal.60 concluded that a  regular consumption of 120 mL per day of green tea for 1 year  significantly \nreduces the risk of developing hypertension. In  another study conducted in China with 1507 subjects, it \nwas found that the daily consumption of around 600 mL of green  tea for one year reduced the risk of \nhypertension compared  with the control group of subjects with similar body mass  index, diet, and \nlifestyle.75 This e ffect may be due to its vas odilator  action, protection against endothelial di ffusion and \nantioxidant  and lipid -lowering properties.  \n \n2.5. Antibacterial and antiviral activity  \nIn 1923, the British Army ’s health authority recommended  hat all soldiers should carry tea in their \ncanteens  to prevent  typhoid fever.12 The e ffectiveness of green tea in any type of  diarrhea has been \nknown in Asia since ancient times.  Nowadays it is known that it inhibits the multiplication and  growth of \nnumerous bacteria including some species of  Salmonella and Bacillus ,8,39 Helicobacter pylori ,77 \nStaphylococcus  aureus ,78 Clostridium perfringens ,79 Candida albicans 80 and  Pseudomonas \naeruginosa .81 In contrast, green tea is safe for the  intestinal microbiota, which is a great advantage over \nother  bactericidal age nts. Recent publications indicate that green tea  could promote the development of \nsome species of  Bifidobacterium.82 These aspects have been recently reviewed  by Siddiqui et al. 83 \nThese authors a ffirm that extracts of tea  could be used as antimicrobial age nts with new mechanisms  of \nresistance.  \n \nRegarding its action against viruses, the use of green tea on  influenza virus is well known, especially at \nthe earliest stage,84  as well as on the Herpes simplex virus.85 EGCG has also been  shown to inhibit \nHIV-1 repl ication by the inhibition of reverse  Review Food & Function transcriptase.39 In addition, \nEGCG from green tea has received  important attention for its e ffects on Zika virus infection in  Brazil.86 \nAccording to Mahmood et al.87 the antiviral activity of  green tea shows a promising future as a popular \ndrink and  also as a potential therapeutic agent.  \n \n2.6. E ffect on oral health  \nGreen tea has a protective e ffect against dental caries, which is  attributable to its fluoride content and \nthe bactericidal e ffect of po lyphenols.88,89 Catechins not only avoid the formation of  tartar by the \nprevention of gingivitis and halitosis, but also act  by eliminating bacteria involved in the cariogenic \nprocess  (Escherichia coli , Streptococcus salivarius , Porphyromonas gingivalis  or Streptococcus mutans ). \nMoreover, catechins inhibit the  activity of salivary α-amylase, decreasing the cariogenic potential  of Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 7 \n hydrocarbon foods and caries formation.12,89 –91 Linke  and LeGeros90 indicated that the frequent \nintake of green tea  significantly  reduces the risk of dental caries, even with the  concomitant presence of \nsugars in the diet. Some authors even  suggest that green tea extracts may exert a preventive e ffect on  \noral cancer.12,92 Currently, green tea is widely used in products  intended for oral hygiene such as \ntooth paste or mouthwashes  with chlorhexidine.89  \n \n2.7. Protection against solar radiation  \nSeveral epidemiological, clinical and biological studies have  demonstrated the carcinogenicity of intense \nand prolonged  exposure to ultraviolet li ght. EGCG and other tea catechins are  considered potent \ntopical protective agents against this type of  radiation, also preventing premature photoaging, certain \nskin pathologies and even carcinogenic processes.12,85,93,94  Currently, green tea is widely used  in \ncosmetics and in some  dermatological treatments, for example against acne.  \n \n2.8. E ffects on the processes of lipolysis and thermogenesis   \nIn vitro assays performed with green tea extracts with a high  catechin content (approximately 25% w/w) \nhave shown th eir ability to drastically inhibit gastric lipase and, to a lesser  extent, pancreatic lipase under \nphysiological conditions.  Consequently, lipolysis of long chain triglycerides is reduced  by 37%.95 \nSimilarly, in vitro tests have also demonstrated that  green tea extracts interfere in the process of \nemulsifying fats, a  preceding and essential step for the intestinal absorption of  fats.25,95  \n \nGreen tea may influence thermogenesis, not only by the  action of ca ffeine, but also because EGCG can \nincrease energy  expenditure by acting on cAMP levels, which suggests a potential  effect on body weight \ncontrol.96,97 Catechins are known to  activate AMP -activated protein kinase (AMPK), an enzyme  \ninvolved in the control of energetic metabolism both at cellular  and organic le vels.96,98 Activation of \nAMPK inhibits the  process of di fferentiation of adipocytes and the expression of  lipogenic enzymes such \nas fatty acid synthetase or acetyl -CoA carboxylesterase. Catechins also have the ability to promote  \nleptin release and attenuat e the symptoms associated with  metabolic syndrome. However, the \nmolecular mechanisms  responsible for these changes are unknown.21 In vitro studies  have shown that \nEGCG interacts with noradrenaline to stimulate  the thermogenesis of brown adipose tissue and to \nregulate  various enzymes related to lipid anabolism and catabolism.99  In this way, extracts of white tea \nstimulate lipolysis and, at the  same time, inhibit adipogenesis in human adipocytes.100 An  inhibition of \nthe expression of genes involved in glucone ogenesis  and in the synthesis of fatty acids, triglycerides and \ncholesterol  has been observed in rodents.39 A regular consumption  of green tea over a period of more \nthan 10 years has been correlated  with a lower percentage of body fat.101,102  \n \n2.9. E ffect o n glycemic control  \nEGCG not only helps to regulate blood glucose levels but also  renovates impaired pancreatic α-cells \nwhich are responsible for  the production of insulin.12,103,104 Swen75 observed that the  consumption \nof 1.5 g of green tea extract 20 minutes before an  oral dose of glucose significantly reduced blood \nglucose levels.  This e ffect could be due to the inhibitory e ffect of catechins  present in green and white \nteas on the activity of α-amylase  and α-glucosidase enzymes, which could control postprandial  \nhyperglycemia.105 The consumption of white tea also improves  glucose tolerance and insulin sensitivity \nand improves the  levels of protein oxidation due to the production of ROS in diabetes.  104 More details \nabout the mechanisms underlying the  effect of green tea consumption on diabetes are included in  the \nrecent revision reported by Ferreira et al.106  \n \n2.10. Other e ffects \nGreen and white teas intensify the immune function as they  protect against oxidants and free radicals. \nTheir usefulness  against insect bites, mainly due to the anti -inflammatory and  anti-hemorrhagic action, is \nwell known. Several studies poin ted out a positive e ffect on osteoporosis, since green tea polyphenols  Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 8 \n modulate osteoblastogenesis and osteoclastogenesis,  by increasing the bone mineral density due to their \nantioxidant  and anti -inflammatory activities.107,108 Other positive e ffects are  associated with the \nprevention of renal and hepatic calculi, and  the prevention of senile cataract and positive e ffects in  \npatients with epilepsy, Parkinson ’s disease, depression or  stroke.12,32,109 –113 Regarding the e ffects on \nParkinson ’s disease,  green an d white teas seem to act through a modulation of oxidative  stress in the \nbrain, neuroinflammation, protein aggregation  and neuronal death.112,114,115 The therapeutic potential \nof green tea in the pathology of fatty liver of non -alcoholic etiology  has also been described.19,116 \nHowever, the authors agree that  additional research is needed to confirm these data.   \n \n3. POSSIBLE NEGATIVE  EFFECTS OF WHITE  AND GREEN TEA CONSUM PTION  \nAlthough the ca ffeine content is not very high, the consumption  of green and white te as is not \nrecommended in people  especially sensitive to xanthic bases. Additionally, consumption  is not \nrecommended in patients with serious cardio - vascular problems or in those with gastroduodenal ulcer, \nsince tea facilitates gastric secretion.117 It is advisable to reduce  their consumption to 1 –2 cups per day \nin pregnant women  since tea can reduce the bioavailability of folic acid. In general,  their consumption \nshould be reduced in people with anemia  due to the possible interaction of tea tannins with Fe  and \nespecially in the case of megaloblastic anemia.28 The presence  of aluminum may be rather elevated in \nsome types of tea  because of a notable influence of cultivated and processed soil  levels.16 On the other \nhand, drinking too hot tea may increase  the r isk of esophageal cancer.118 Finally, a very high \nconsumption  of green or white tea would lead to excessive intake of  flavonoids, which would give rise \nto the formation of ROS  that would cause damage in DNA, lipid membranes and  proteins.117  \n \n4. CONCLUSIONS  \nThe health e ffects associated with the consumption of green  and white teas include protection against \nhypertension and  cardiovascular diseases, promotion of oral health, control of  body weight, antibacterial \nand antiviral activity, protection  against UV ra diation, increase of bone mineral density, and  antifibrotic \nand neuroprotective properties, among others.  These e ffects are related to their high content of \npolyphenols  and in particular catechins, where EGCG stands out due to its  high antioxidant potentia l, \nwhich even surpasses that found in  vitamins C and E. The e ffects are also related to the presence  of \ncaffeine and L -theanine, an amino acid with interesting biological  effects. Green and white teas may also \nbe a source of  some minerals, including Mn and  F. Recent studies indicate  that the consumption of green \nand white teas may contribute  to reduce the risk of some types of cancer. The use of natural  \nantioxidants such as polyphenols are presented as an interesting  proposal for the prevention and \ntherapy of carcinogenic  processes and therefore their mechanisms of action have  aroused great \nscientific interest. Several authors advise the use  of catechins present in tea as a preventive or adjuvant \ntreatment  to other chemical treatments. Although results about  EGCG activity are highly promising, a \nmore precise knowledge  of the molecular mechanisms of action in vivo is needed.  Following the e ffects \ndescribed on health, green tea has been  included in the list of foods with functional properties.  Scientific \neviden ce is very promising but future studies are  necessary to test these findings taking into account \nenvironmental,  dietary and lifestyle factors. The available data are  derived mainly from epidemiological \nstudies or the extrapolation  of results obtained from tests with experimental animals  where extracts of \ntea rich in catechins, especially with a high  content of EGCG, were administered. Several authors agree \non the need to expand in vivo evaluations on the absorption, distribution  and metabolism of their main  \ncompounds with antioxidant  activity. Moreover, it would be interesting to carry out  additional studies \nwith a habitual consumption extended in  time more than studies designed with a very high consumption  \nduring a short period of time. For instance, cancer  studies  generally compare a low or no consumption \nversus a high consumption  (even 10 cups per day). Regarding the research  carried out with extracts, a \nbetter control of factors such as  dose or formulation is necessary. This fact is essential in order  to \nbetter identify the product tested and the population which  it can exercise the benefit in. In conclusion, \nfurther research  and well -designed additional studies (observational, epidemiological  and nutritional Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 9 \n intervention) are needed to define the  current magnitude of health e ffects of tea, to establish the  range \nof safety of the consumption associated with beneficial  effects and to elucidate the possible mechanisms \nof action as  a basis for future nutritional claims related to both green and  white teas.  \n \nGreen and white teas have a number of advantages that  make them a very good alternative to other \nbeverages which  are widely consumed and less healthy. They are beverages with  a pleasant flavor \n(flowers and fruit aroma with low levels of bitterness  and astring ency) that are even commercialized \nflavored  with other fruits and flowers. They are popular beverages,  socially well accepted, economical, \nsafe and consumed daily  by hundreds of millions of people in the five continents.  Currently, these teas \nare widely us ed in the preparation of  various foods and cosmetics based primarily on the antioxidant  \nactivity, acting as a natural, e ffective, and safe preservative.  However, their consumption in western diets \nis still  limited and sporadic. Due to the high content of a ntioxidants,  it is recommended that tea \nconsumption be included in a  nutritional, varied and balanced diet. Some authors even  define the \nconsumption of green and white teas as a ‘gift of  nature ’ for human health.  \n \nACKNOWLEDGEMENTS  \nThis work was supported by  the project AGL2014 -53895 -R from  the Spanish Ministry of Economy and \nCompetitiveness and  the European Fund of Regional Development (FEDER). This  paper is dedicated to \nProf. Carmen Cabrera, who passed away  in 2016. We thank Glenn K. Harding for proofreadin g the  \nEnglish -language manuscript.  \n \nREFERENCES  \n1 H. McKinley and M. Jamieson, Handbook of Green Tea and  Health Research , Nova Publishers, New \nYork, 2009.  \n2 Y. Hilal and U. Engelhardt, Characterisation of white tea - comparison to green and black tea, J. \nConsum. Prot. Food  Saf., 2007, 2, 414–421. \n3 C. Espinosa, J. A. López -Jiménez, L. Cabrera, E. Larqué,  M. P. Almajano, M. B. Arnao, S. Zamora and F. \nPérez -Llamas, Protective e ffect of white tea extract against acute  oxidative injury caused by adriamycin \nin different tissues,  Food Chem. , 2012, 134, 1780 –1785.  \n4 N. Muller, S. Ellinger, B. Alteheld, G. Ulrich -Merzenich,  H. K. Berthold, H. Vetter and P. Stehle, Bolus \ningestion  and white and green tea increases the concentration of  several flavan -3-ols in plasma, b ut does \nnot a ffect markers  of oxidative stress in healthy non -smokers, Mol. Nutr. Food  Res., 2010, 54, 1636 –\n1645.  \n5 U. J. Unachukwu, S. Ahmed, A. Kavalier, J. T. Lyles and  E. J. Kennelly, White and green teas ( Camellia \nsinensi s, var. sinensis ): variation i n phenolic, methylxanthine, and  antioxidant profiles, J. Food Sci. , 2010, \n75, 541–548. \n6 A. Alcazar, O. Ballesteros, J. M. Jurado, F. Pablos,  M. J. Martin, J. L. Vilches and A. Navalon, \nDifferentiation  of green, white, black, Oolong, and Pu -erh teas accord ing to their free amino acids \ncontent, J. Agric. Food Chem. , 2007, 55, 5960 –5965.  \n7 G. Santana -Rios, G. A. Orner, A. Amantana, C. Provost,  S. Y. Wu and R. H. Dashwood, Potent \nantimutagenic  activity of white tea in comparison with green tea in the  Salmonell a assay, Mutat. Res. , \n2001, 495, 61–74. \n8 M. P. Almajano, I. Vila and S. Gines, Neuroprotective  effects of white tea against oxidative stress -\ninduced toxicity  in striatal cells, Neurotox. Res. , 2011, 20, 372–378. \n9 G. Rusak, D. Komes, S. Likic, D. Horzic a nd M. Kovac,  Phenolic content and antioxidative capacity of \ngreen tea  and white tea extracts depending on extraction conditions  and the solvent used, Food Chem. , \n2008, 110, 852–858. \n10 W. Dai, D. Xie, M. Lu, P. Li, H. Lv, C. Yang, Q. Peng,  Y. Zhu, L. Guo, Y. Zhang, J. Tan and Z. Lin,  \nCharacterization of white tea metabolome: Comparison  against green and black tea by a non targeted \nmetabolomics  approach, Food Res. Int. , 2017, 96, 40–45. Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 10 \n 11 N. Khan and H. Mukhtar, Tea polyphenols for health promotion,  Life Sc i., 2007, 81, 519–533. \n12 C. Cabrera and R. Giménez, in Tratado de Nutrición , ed. A. Gil, Editorial Médica Panamericana, \nMadrid, Café, té,  cacao y productos derivados, 2010, pp. 353 –355. \n13 P. Carloni, L. Tiano, L. Padella, T. Bacchetti, C. Customu,  A. Kay  and E. Damiani, Antioxidant activity \nof white,  green and black tea obtained from the same tea cultivar,  Food Res. Int. , 2013, 53, 900–908. \n14 C. Cabrera, R. Giménez and M. C. López, Determination  of tea components with antioxidant activity, \nJ. Agric. Food  Chem. , 2003, 51, 4427 –4435.  \n15 R. Street, I. Szakova, O. Drabek and L. Mladkova, The  status of micronutrients (Cu, Fe, Mn, Zn) in \ntea and tea  infusions in selected samples imported to the Czech  Republic, Czech J. Food Sci. , 2006, 24, \n62–71. \n16 T. Karak an d R. M. Bhagat, Trace elements in tea leaves,  made tea and tea infusion: a review, Food \nRes. Int. , 2010,  43, 2234 –2252.  \n17 J. Brzezicha -Cirocka, M. Grembecka and P. Szefer,  Monitoring of essential and heavy metals in green \ntea from di fferent geographical o rigins, Environ. Monit.  Assess. , 2016, 188, 183.  \n18 C. Y. Peng, H. M. Cai, X. I. Zhu, D. X. Li, Y. Q. Yang,  R. Y. Hou and X. C. Wan, Analysis of naturally \noccurring  fluoride in commercial teas and estimation of its daily  intake through tea consumption, J. Food \nSci., 2016, 81, H235 –H239.  \n19 M. González -Castejón and A. Rodríguez -Casado, Dietary  phytochemicals and their potential e ffects \non obesity:  a review, Pharmacol. Res. , 2011, 64, 438–455. \n20 L. Arab and J. B. Blunberg, Introduction of the proceedings  for the Fourth International Scientific \nSymposium  on Tea and Human Health, J. Nutr. , 2008, 138, 1526 –1528.  \n21 USDA Database for the flavonoid contents of selected  foods. US Department of Agriculture, \nBeltsville, https:// www.ars.usda.gov/northeast -area/belts ville-md/beltsvillehuman -nutrition -research -\ncenter/nutrient -data-laboratory/ docs/usda -database -for-the-flavonoid -content -of-selectedfoods -release -\n31-december -2013/ (accessed February 2017).  \n22 S. Gorjanovic, D. Komes, F. T. Pastor, A. Belscak -Cvitanovi c, L. Pezo, I. Hecinmovic and D. Suznjevic,  \nAntioxidant capacity of teas and herbal infusions: polarographic  assessment, J. Agric. Food Chem. , 2012, \n60, 9573 –9580.  \n23 F. Hajiaghaalipour, J. Sanusi and M. S. Kanthimathi,  Temperature and Time of Steeping A ffect the \nAntioxidant  Properties of White, Green, and Black Tea Infusions,  J. Food Sci. , 2016, 81, H246 –H254.  \n24 J. Tan, U. H. Engelhardt, Z. Lin, N. Kaiser and B. Maiwald,  Flavonoids, phenolic acids, alkaloids and \ntheanine in  different types of authentic C hinese white tea samples,  J. Food Compos. Anal. , 2017, 57, 8–\n15. \n25 M. Furase, N. Adachi, S. Tomonaga, M. Yamane and  D. M. Denbow, Handbook of green tea and \nhealth research , ed. H. McKinley and M. Jamieson, Nova Science  Publishers Inc., New York, 2009, \nCentral functions of  green tea components.  \n26 Y. Zhao, P. Chen, L. Lin, J. M. Harnly, L. Yu and Z. Li,  Tentative identification, quantitation, and \nprincipal  component analysis of green pu -erh, green, and white  teas using UPLC/DAD/MS, Food Chem. , \n2011, 126, 1269–1277.  \n27 C. D. Wu and G. X. Wei, Tea as a functional food for oral  health, Nutrition , 2002, 18, 443–444. \n28 R. Johnson, S. Bryant and A. L. Huntley, Green tea and  green tea catechin extracts: an overview of \nthe clinical evidence,  Maturitas , 2012, 73, 280–287. \n29 H. Schroeter, J. P. Spencer, C. Rice -Evans and  R. J. Williams, Flavonoids protect neurons from \noxidized  low-density -lipoprotein -induced apoptosis involving c -JunN-terminal kinase (JNK) and capase -3, \nBiochem. J., 2001,  358, 547–557. \n30 V. C. Rod rigues, M. V. da Silva, A. R. dos Santos,  A. A. F. Zielinski and C. W. I. Haminiuk, Evaluation \nof hot  and cold extraction of bioactive compounds in teas,  Int. J. Food Sci. Technol. , 2015, 50, 2038 –\n2045.  \n31 S. Pastoriza, S. Pérez -Burillo and J. A. Rufián -Henares,  How brewing parameters a ffect the healthy \nprofile of tea,  Curr. Top. Food Sci. Technol. , 2017, 14, 7–12. Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 11 \n 32 R. Cooper, Green tea and theanine: health benefits,  Int. J. Food Sci. Nutr. , 2012, 63, 90–97. \n33 G. C. Tenore, P. Campiglia, D. Giannetti and E. Novellino,  Simulated gastrointestinal digestion, \nintestinal permeation  and plasma protein interaction of white, green,  and black tea polyphenols, Food \nChem. , 2015, 169, 320–326. \n34 J. L. Di Gesso, J. S. Kerr, Q. Zhang, S. Raheem,  S. K. Yalamanchili, D. O ’Hagan, C. D.  Kay and  M. A. \nO’Connell, Flavonoid metabolites reduce tumor  necrosis factor -α secretion to a greater extent than \ntheir precursor compounds in human THP -1 monocytes, Mol. Nutr. Food Res. , 2015, 59, 1143 –1154.  \n35 J. D. Lambert, S. Sang, A. Y. Lu and C. S. Y ang, Metabolism of dietary polyphenols and possible \ninteractions  with drugs, Curr. Drug Metab. , 2007, 8, 499–507. \n36 M. R. De Oliveira, S. F. Nabavi, M. Daglia, L. Rastrelli and  S. M. Nabavi, Epigallocatechin gallate and \nmitochondria -A story of life and de ath, Pharm. Res. , 2016, 104, 70–85. \n37 J. D. Lambert and C. S. Yang, Mechanisms of cancer prevention  by tea constituents, J. Nutr. , 2003, \n133, 3262 –3267.  \n38 A. Mittal, M. S. Pate, R. C. Wylie, T. O. Tollesfsbol and  S. K. Katiyar, EGCG down regulates \ntelome rase in human  breast carcinoma MCF -7 cells, leading to suppression of  cell viability and induction \nof apoptosis, Int. J. Oncol. , 2004, 24, 703–710. \n39 N. T. Zaveri, Green tea and its polyphenolic catechins:  medicinal uses in cancer and non -cancer \napplicati ons, Life Sci. , 2006, 78, 2073 –2080.  \n40 I. C. Arts, A review of the epidemiological evidence on tea,  flavonoids, and lung cancer, J. Nutr. , \n2008, 138, 1561 –1566.  \n41 C. Espinosa, F. Pérez -Llamas, F. A. Guardiola,  M. A. Esteban, M. B. Arnao, S. Zamora and J . A. López - \nJiménez, Molecular mechanisms by which white tea prevents  oxidative stress, J. Physiol. Biochem. , 2014, \n70, 891–900. \n42 A. Winiarska -Mieczan, The potential protective e ffect of  green, black, red and white tea infusions \nagainst adverse  effect o f cadmium and lead during chronic exposure e A  rat model study, Regul. Toxicol. \nPharmacol. , 2015, 73, 521–529. \n43 C. Espinosa, J. A. López -Jiménez, F. Pérez -Llamas,  F. A. Guardiola, M. A. Esteban, M. B. Arnaoc and  S. \nZamora, Long -term intake of white tea prevents oxidative  damage caused by Adriamycin in kidney of \nrats, J. Sci. Food Agric. , 2015, 96, 3079 –3087.  \n44 S. Langley -Evans, Antioxidant potential of green and black  tea determined using the ferric reducing \npower (FRAP)  assay, Int. J. Food Sci. Nutr. , 2000, 51, 181–188. \n45 USDA, U. S. Department of Agriculture, Agricultural  Research Service. Oxygen Radical Absorbance \nCapacity  (ORAC) of Selected Foods, Release 2, http://oracdatabase. com (accessed January 2017).  \n46 M. H. Carlsen, B. L. Halvorsen, K. Holt e, S. K. Bohn,  S. Dragland, L. Sampson, C. Willey, H. Senoo,  Y. \nUmezono, C. Sanada, I. Barikmo, N. Berhe,  W. C. Willett, K. M. Phillips, D. R. Jacobs and  R. Blomho ff, \nThe total antioxidant content of more than  3100 foods, beverages, spices herbs and supple ments  used \nworldwide, Nutr. J. , 2010, 9, 3–41. \n47 F. L. Chung, J. Schwartz, C. R. Herzog and Y. M. Yang, Tea  and cancer prevention: studies in animals \nand humans,  J. Nutr. , 2003, 133, 3268 –3274.  \n48 D. Erba, P. Riso, A. Bordoni, P. Foti, P. L. Biagi and  G. Testolin, E ffectiveness of moderate green tea \nconsumption  on antioxidative status and plasma lipid profile in  humans, J. Nutr. Biochem. , 2005, 16, \n144–149. \n49 X. Wang and E. K. Michaelis, Selective neuronal vulnerability  to oxidative stress in the brain, Front \nAging  Neurosci. , 2010, 2, 12. \n50 K. Unno, A. Hara, A. Nakagawa, K. Iguchi, M. Ohshio,  A. Morita and Y. Nakamura, Anti -stress e ffects \nof drinking  green tea with lowered ca ffeine and enriched theanine,  epigallocatechin and arginine on \npsychosocial stres s induced adrenal hypertrophy in mice, Phytomedicine , 2016, 23, 1365 –1374.  \n51 M. Vignes, T. Maurice, F. Lante, M. Nedjar, K. Thethi,  J. Guiramand and M. Recasens, Anxiolytic \nproperties of  green tea poyphenol ( -)-epigallocatechin gallate (EGCG),  Brain Res. , 2006, 1110, 102–115. Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 12 \n 52 R. Shastry, S. D. Ullal, S. Karkala, S. Rai and A. Gadgade,  Anxiolytic activity of aqueous extract of \nCamellia sinensis  in rats, Indian J. Pharmacol. , 2016, 48, 681–686. \n53 W. Dimpfel, A. Kler, E. Kriesl and R. Lehnfeld, Theogallin  and L -theanine as active ingredients in \ndecaffeinated  green tea extract. I. Electrophysiological characterization  in the rat hippocampus in vitro , J. \nPharm. Pharmacol. , 2007, 59, 1131 –1136.  \n54 K. Kimura, M. Ozeki, L. R. Juneja and H. Ohira, L -theanine  reduces psychological and physiological \nstress  responses, Biol. Psychol. , 2007, 74, 39–45. \n55 D. A. Camfield, C. Stough, J. Farrimond and A. B. Scholey,  Acute e ffects of tea constituents L -\ntheanine, ca ffeine, and  epigallocatechin gallate on cognitive function  and mood:  a systematic review and \nmeta-analysis, Nutr. Rev. , 2014,  72, 507–522. \n56 P. T. Quinlan, J. Lane, K. L. Moore, J. Aspen, J. A. Rycroft  and D. C. O ’Brien, The acute physiological \nand mood  effects of tea and co ffee: the role of ca ffeine level,  Pharmacol., Biochem. Behav. , 2000, 66, 19–\n28.  \n57 M. Suganuma, A. Saha and H. Fujiki, New cancer  treatment strategy using combination of green tea \ncatechins  and anticancer drugs, Cancer Sci. , 2011, 102, 317–323. \n58 M. C. García -Rodríguez, R. E. Vilchez, T. Nic olás and  M. A. Altamirano, El Green tea en la \nquimioprevención  in vivo del daño genotóxico inducido por metales  cancerígenos (cromo [VI]), Nutr. \nHosp. , 2012, 27, 1204 –1212.  \n59 J. C. Hakim, Green tea consumption is associated with  decreased DNA damage amon g GSTM1 \npositive smokers  regardless of their hOGG1 genotype, J. Nutr. , 2008, 138, 1567–1571.  \n60 C. S. Yang and H. Wang, Cancer preventive activities of  tea catechins, Molecules , 2016, 21, 1679.   \n61 M. Inoue, K. Tajima, M. Mizutani, H. Iwata, T. Iwase,  S. Miura, K. Hirose, N. Hamajima and S. \nTomonaga,  Regular consumption of green tea and risk of breast  cancer recurrence: follow -up study \nfrom the Hospital  based  Epidemiological Research Program at Aichi Cancer  Center (HERPACC), Japan, \nCancer Lett. , 2001, 167, 175–182. \n62 R. J.  Rosengren, Catechins and the treatment of breast  cancer: possible utility and mechanistic \ntargets, Drugs , 2003, 6, 1073 –1078.  \n63 S. A. Laurie, V. A. Miller, S. C. Grant and M. G. Kris, Phase  I study of green tea extract in patients \nwith advanced lung  cancer, Cancer Chemother. Pharmacol. , 2005, 155, 33–38. \n64 I. A. Siddiqui, M. Asim, B. B. Hafeez, V. M. Adhami,  R. S. Tarapore and H. Mukhtar, Green tea \npolyphenol  EGCG blunts androgen receptor function in prostate  cancer, FASEB J. , 2010, 16, 571–582. \n65 M. Su ganuma, A. Takahashi, T. Watanabe, K. Iida,  T. Matsuzaki, H. Y. Yoshikawa and H. Fujiki, \nBiophysical  approach to mechanisms of cancer prevention and  treatment with green tea catechins, \nMolecules , 2016, 21, 1566.  \n66 G. Bianchi, J. Cerhan, A. Parker, S. Putn am, W. See,  C. Lynchi and K. Cantor, Tea consumption and \nrisk of  bladder and kidney cancers in a population -based case  control  study, Am. J. Epidemiol. , 2000, \n151, 377–383. \n67 T. Yamamoto, S. Hsu, J. Lewis, J. Wataha, D. Dickinson,  B. Singh, W. B. Bollag, P . Lockwood, E. Ueta, \nT. Osaki and  G. Schuster, Green tea polyphenols causes di fferential oxidative  environments in tumor \nversus normal epithelial  cells, J. Pharmacol. Exp. Ther. , 2003, 301, 230–236. \n68 M. J. Li, Y. C. Yin, J. Wang and Y. F. Jiang, Green te a compounds  in breast cancer prevention and \ntreatment, World  J. Clin. Oncol. , 2014, 5, 520–528. \n69 B. N. Singh, S. Shankar and R. K. Srivastava, Green tea  catechin, epigallocatechin -3-gallate (EGCG): \nmechanisms,  perspectives and clinical applications, Biochem. Pharmacol. , 2011, 82, 1807 –1821.  \n70 J. Yarmolinsky, G. Gon and P. Edwards, E ffect of tea on  blood pressure for secondary prevention of \ncardiovascular  disease: a systematic review and meta -analysis of randomized  controlled trials, Nutr. Rev. , \n2015, 73, 236–246. \n71 C. Tian, Q. Huang, L. Yang, S. Légaré, F. Angileri, H. Yang,  X. Li, X. Min, C. Zhang, C. Xu, J. Yuan, X. \nMiao, M. A. He,  T. Wu and X. Zhang, Green tea consumption is associated  with reduced incident CHD \nand improved CHD -related  biomarkers in t he Dongfeng -Tongji cohort, Sci. Rep. , 2016,  6, 24353.  Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 13 \n 72 A. Kim, A. Chiu, M. K. Barone, D. Avino, F. Wang and  C. I. Coleman, Green tea catechins decrease \ntotal and low  density  lipoprotein cholesterol: a systematic review and  meta-analysis, J. Am. Diet. Asso c., \n2011, 111, 1720 –1729.  \n73 H. Samavat, A. R. Newman, R. Wang, J. M. Yuan, A. H. Wu  and M. S. Kurzer, E ffects of green tea \ncatechin extract on  serum lipids in postmenopausal women: a randomized,  placebo -controlled clinical \ntrial, Am. J. Clin. Nutr. , 2016,  104, 1671 –1682.  \n74 M. P. Almajano, R. Carbó, J. A. López Jiménez and  M. H. Gordon, Antioxidant and antimicrobial \nactivities of  tea infusions, Food Chem. , 2008, 108, 55–63. \n75 W. Swen, E ffects of green tea and EGCG on cardiovascular  and metabolic health, J. Am. Coll. Nutr. , \n2007, 26, 373–388. \n76 A. E. Koutelidakis, K. Argiri, M. Serafini, C. Proestos,  M. Komaitis, M. Percorari and M. Kapsokefalou, \nGreen  tea, white tea, and Pelargonium purpureum increase the  antioxidant capacity of plasma and some \norgans in  mice,  Nutrition , 2009, 25, 453–458. \n77 P. Ruggiero, G. Rossi, F. Tombola, L. Pancotto, L. Lauretti,  G. D. Giudice and M. Zoratti, Red wine \nand green tea  reduce H pylori – or VacA -induced gastritis in mouse  model, Word J. Gastroenterol. , \n2007, 13, 349–354. \n78 P. W. West, T. C. Mathew, N. J. Miller and Q. Electricwala,  The e ffect of green tea on the growth \nand morphology of  methicillin -resistan and methicillin -susceptible  Staphylococcus aureus , J. Nutr. \nEnviron. Med. , 2001, 11, 263–269. \n79 V. K. Juneja, M. L . Bari, Y. Inatsu, S. Kawamoto and  M. Friedman, Control of Clostridium perfringen s, \nspores by  green tea leaf extracts during cooling and cooked ground  beef, chicken, and pork, J. Food \nProt., 2007, 70, 1429 –1433.  \n80 M. Hirasawa and K. Takada, Multiple e ffects of green tea  catechin on the antifungal activity of \nantimycotics against  Candida albicans , J. Antimicrob. Chemother. , 2004, 53, 225–229. \n81 S. M. Yi, J. L. Zhu, L. L. Fu and J. R. Li, Tea polyphenols  inhibit Pseudomonas aeruginos a, through \ndamage to t he cell membrane, Int. J. Food Microbiol. , 2010, 144, 111–117. \n82 J. S. Jin, M. Touyama, T. Hisada and Y. Benno, E ffects of  green tea consumption on human fecal \nmicrobiota with  special reference to Bifidobacteriu m, species, Microbiol.  Immunol. , 2012, 56, 729–739. \n83 M. W. Siddiqui, S. J. P. Singh, P. K. Thakur, J. F. Ayala -Zavala, A. Singh and R. S. Dhua, Antimicrobial \nproperties  of teas and their extracts in vitro, Crit. Rev. Food Sci. Nutr. , 2015, 56, 1428 –1439.  \n84 H. J. Lee, Y. N. Lee, H. N. Youn, D. H.  Lee, J. H. Kwak,  B. L. Seong, J. B. Lee, S. Park, I. S. Choi and C. \nS. Song,  Anti-influenza virus activity of green tea by -products in  vitro and e fficacy against influenza virus \ninfection in  chickens, Poult. Sci. , 2012, 91, 66–73. \n85 C. Cabrera, R. Artach o and R. Giménez, Beneficial e ffects of green tea – a review, J. Am. Coll. Nutr. , \n2006, 25, 79–99. \n86 B. M. Carneiro, M. N. Batista, N. C. S. Braga,  M. L. Nogueira and P. Raha, The green tea molecule  \nEGCG inhibits Zika virus entry, Virology , 2016, 496, 215–218. \n87 M. S. M ahmood, J. L. Mártinez, A. Aslam, A. Rafique,  R. Vinet, C. Laurido, I. Hussain, R. Z. Abbas, A. \nKhan and  S. Al, Antiviral e ffects of green tea (camellia sinensis)  against pathogenic viruses in human and \nanimals (a  mini-review), Afr. J. Tradit., Complementa ry Altern. Med. , 2016, 13, 176–184. \n88 A. Simpson, L. Shaw and A. J. Smith, The bioavailability of  fluoride from black tea, J. Dent. , 2001, 29, \n15–21. \n89 B. Narotzki, A. Z. Reznick, D. Aizenbud and Y. Levy, Green  tea: a promising natural product in oral \nhealth, Arch. Oral  Biol., 2012, 57, 429–435. \n90 H. A. Linke and R. Z. LeGeros, Black tea extract and dental  caries formation in hamsters, Int. J. Food \nSci. Nutr. , 2003,  54, 89–95. \n91 M. Okamoto, A. Sugimoto, K. P. Legun, K. Nakayama,  A. Kamaguchi and N. Maed a, Inhibitory e ffect \nof green tea  catechins on cysteine proteinases in Porphyromonas gingivalis , Oral Microbiol. Immunol. , \n2004, 19, 118–120. Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 14 \n 92 M. J. Lee, J. D. Lambert, S. Prabhu, X. F. Meng, H. Lu,  P. Maliakal, C. T. Ho and C. S. Yang, Delivery of \ntea p olyphenols  to the oral cavity by green tea leaves and black tea  extract, Cancer Epidemiol. \nBiomarkers Prev. , 2004, 13, 132–137. \n93 R. K. Harwnash, P. K. Mukherjee, A. Kar, S. Bahadur,  N. A. Al -Dhabi and V. Duraipandiyan, \nEnhancement of  photoprotection pot ential of catechin loaded nanoemulsion  gel against UVA induced \noxidative stress,  J. Photochem. Photobiol. , 2016, 160, 318–329. \n94 S. Saric and R. K. Sivamani, Polyphenols and sunburn,  Int. J. Mol. Sci. , 2016, 17, 1521.  \n95 A. Gondoin, D. Grussu, D. Steward and G. J. McDougall,  White and green tea polyphenols inhibit \npancreatic lipase  in vitro , Food Res. Int. , 2010, 43, 1537 –1544.  \n96 T. Murase, K. Misawa, S. Haramizu and T. Hase, Catechin  induced  activation of the LKB1/AMP -\nactivated protein  kinase pathway, Biochem. Pharmacol. , 2009, 78, 78–84. \n97 D. Türközü and N. A. Tek, A mini  review of e ffects of green  tea on energy expenditure, Crit. Rev. \nFood Sci. Nutr. , 2017,  57, 254–258. \n98 T. Suzuki, M. Pervin, S. Goto, M. Isemura and  Y. Nakamura, Beneficial e ffects of t ea and the green tea  \ncatechin epigallocatechin -3-gallate on obesity, Molecules , 2016, 21, 1305.  \n99 A. Rocha, A. P. Bolin, C. A. L. Cardoso and R. Otton, Green  tea extract activates AMPK and \nameliorates white adipose  tissue metabolic dysfunction induced by obesity,  Eur. J. Nutr. , 2016, 55, 2231 –\n2244.  \n100 J. Söhle, A. Knott, U. Holtzmann, R. Siegner,  E. Grönniger, A. Schepky, S. Gallinat, H. Wenck, F. Stäb  \nand M. Winnefeld, White tea extract induces lipolytic  activity and inhibits adipogenesis in human \nsubcut aneous  (pre)-adipocytes, Nutr. Metab. , 2009, 6, 20. \n101 G. Zheng, K. Sayama, T. Okubo, L. R. Juneja and I. Oguni,  Anti-obesity e ffects of three major \ncomponents of green  tea, catechins, ca ffeine and theanine, in mice, In Vivo , 2004, 18, 55–62. \n102 M. J. Am iot, C. Riva and A. Vinet, E ffects of dietary polyphenols  on metabolic syndrome features in \nhumans: a  systematic review, Obes. Rev. , 2016, 17, 573–586. \n103 M. C. Sabu, K. Smitha and K. Ramadasan, Anti -diabetic  activity of green tea polyphenols and their \nrole in reducing  oxidative stress in experimental diabetes,  J. Ethnopharmacol. , 2002, 83, 109–116. \n104 M. G. Alves, A. D. Martins, N. F. Teixeira, L. Rato,  P. F. Oliveira and B. M. Silva, White tea \nconsumption  improves cardiac glycolytic and oxidative profil e of prediabetic  rats, J. Funct. Foods , 2015, \n14, 102–110. \n105 M. Yilmazer -Musa, A. M. Gri ffith, A. J. Michels,  E. Schneider and B. Frei, Grape seed and tea extracts \nand catechin 3 -gallates are potent inhibitors of α-amylase and  α-glucosidase activity, J. Agric. Food \nChem. , 2012, 60, 8924 –8929.  \n106 M. A. Ferreira, D. M. Silva, A. C. de Morais, J. F. Mota and  P. B. Botelho, Therapeutic potential of \ngreen tea on risk  factors for type 2 diabetes in obese adults – a review, Obes.  Rev., 2016, 17, 1316 –\n1328.  \n107 L. Dudaric, A. Fuzinac -Smojver, D. Muhvic and  J. Giacometti, The role of polyphenols on bone \nmetabolism  in osteoporosis, Food Res. Int. , 2015, 77, 290–298. \n108 C. L. Shen, J. Han, S. Wang, E. Chung, M. C. Chyu and  J. J. Cao, Green tea supplementation bene fits \nbody composition  and improves bone properties in obese female  rats fed with high -fat diet and caloric \nrestricted diet, Nutr.  Res., 2015, 35, 1095 –1105.  \n109 K. Naghma and H. Mukhtar, Tea polyphenols for health  promotion, Life Sci. , 2007, 81, 519–533. \n110 Y. Clement, Can green tea do that? A literature review of  the clinical evidence, Prev. Med. , 2009, \n49, 83–87. \n111 S. M. Nabavi, M. Daglia, A. H. Moghaddam, S. F. Nabavi  and V. Curti, Tea consumption and risk of \nischemic  stroke: a brief review of the lit erature, Curr. Pharm.  Biotechnol. , 2014, 15, 298–303. \n112 J. Renaud, S. F. Nabavi, M. Daglia, S. M. Nabavi and  M. G. Martinoli, Epigallocatechin -3-Gallate, a \npromising  molecule for Parkinson ’s disease?, Rejuvenation Res. , 2015, 18, 257–269. Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 15 \n 113 A. Di Loren zo, S. F. Nabavi, A. Sureda, A. H. Moghaddam,  S. Khanjani, P. Arcidiaco, S. M. Nabavi and \nM. Daglia,  Antidepressive -like e ffects and antioxidant activity of  green tea and GABA green tea in a \nmouse model of poststroke  depression, Mol. Nutr. Food Res. , 2016,  60, 566–579. \n114 J. C. Jurado -Coronel, M. Ávila -Rodríguez, V. Echeverria,  O. A. Hidalgo, J. González, G. Aliev and G. \nBarreto,  Implication of green tea as a possible therapeutic  approach for parkinson disease, CNS Neurol. \nDisord.: Drug  Targets , 2016, 15, 292–300. \n115 Y. Xu, Y. Zhang, Y. Quan, W. Wong, J. Guo, R. Zhang,  Q. Yang, R. Dai, P. L. McGeer and H. Qing,  \nEpigallocatechin Gallate (EGcG) inhibits alpha -synuclein  aggregation: a potential agent for Parkinson ’s \ndisease,  Neurochem. Res. , 2016, 41, 2788 –2796. \n116 C. Mast erjohn and R. S. Bruno, Therapeutic potential of  green tea in non alcoholic fatty liver \ndisease, Nutr. Rev. , 2012, 70, 41–46. \n117 A. Jain, C. Manghani, S. Kohli, D. Nigam and V. Rani, Tea  and human health: the dark shadows, \nToxicol. Lett. , 2013,  220, 82–87. \n118 J. M. Wang, B. Xu, J. Y. Rao, H. B. Shen, H. C. Xue and  Q. W. Jian, Diet habits, alcohol drinking, \ntobacco  smoking, green tea drinking, and the risk of esophageal  squamous cell carcinoma in the Chinese \npopulation,  Eur. J. Gastroenterol. Hepatol. , 2007, 19, 171–176. \n119 J. Malik, J. Szakova, O. Drabek, J. Balik and L. Kokoska,  Determination of certain micro and \nmacroelements in  plant stimulants and their infusions, Food Chem. , 2008,  111, 520–525. \n120 J. S. McKenzie, J. M. Jurado and F. De Pablos,  Chara cterisation of tea leaves according to their total  \nmineral content by means of probabilistic neural networks,  Food Chem. , 2010, 123, 859–864. \n121 K. F. Fung, Z. Q. Zhang, J. W. Wong and M. H. Wong,  Fluoride contents in tea and soil from tea \nplantations and  the release of fluoride into tea liquor during infusion,  Environ. Pollut. , 1999, 104, 197–\n205. \n122 W. S. Shu, Z. Zhang, C. Lan and M. H. Wong, Fluoride  and aluminium concentrations of tea plants \nand tea products  from Sichuan Province, China, Chemosphere , 2003,  52, 1475 –1482.  \n123 Z. Xie, Z. Chen, W. Sun, X. Guo, B. Yin and J. Wang,  Distribution of aluminum and fluoride in tea \nplant and  soil of tea garden in Central and Southwest China, Chin.  Geogr. Sci. , 2007, 17, 376–382. \n124 M. H. Wong, Z. Q. Zhang, J. W.  Wong and C. Y. Lan, Trace  metal contents (Al, Cu and Zn) of tea: \ntea and soil from  two tea plantations, and tea products from di fferent provinces  of China, Environ. \nGeochem. Health , 1998, 20, 87–94. \n125 R. N. Gallaher, K. Gallaher, A. J. Marshall and  A. C. Marshall, Mineral analysis of the types of \ncommercially  available tea, J. Food Compos. Anal. , 2006, 19, 53–57. \n126 S. Nookabkew, N. Rangkadilok and J. Satyavivad,  Determination of trace elements in herbal tea \nproducts  and their infusions consumed in Tha iland, J. Agric. Food  Chem. , 2006, 54, 6939 –6944.  \n127 E. Malinowska, I. Inklelewicz, W. Czarnowski and  P. Szefer, Assessment of fluoride concentration \nand daily  intake by human from tea and herbal infusions, Food  Chem. Toxicol. , 2008, 46, 1055 –1061.  \n128 J. Song, H. Xu, F. Liu and L. Feng, Tea and cognitive  health in late life: current evidence and future \ndirections,  J. Nutr., Health Aging , 2012, 16, 31–34. \n129 T. Jian, B. W. Glickman and J. G. de Boer, Protective e ffect of green tea against benzo -α-pyrene-\ninduced mutations in  the liver of Big Blue transgenic mice, Mutat. Res. , 2001,  480, 147–151. \n130 H. Fujiki and M. Sumanuma, Green tea: an e ffective synergist  with anticancer drugs for tertiary \ncancer prevention,  Cancer Lett. , 2012, 324, 119–125. \n131 S . Wofram, E ffects of green tea and EGCG on cardiovascular  and metabolic health, J. Am. Coll. \nNutr. , 2007, 26, 373–388. \n132 M. Boschmann and F. Thielecke, The e ffects of epigallocatechin - 3-gallate on themogenesis and fat \noxidation in  obese men: a pilot stu dy, J. Am. Coll. Nutr. , 2007, 26, 389–395. \n133 D. Richard, K. Kefi, U. Barbe, A. Poli, P. Bausero and  F. Visioli, Weight and plasma lipid control by \ndecaffeinated  green tea, Pharmacol. Res. , 2009, 59, 351–354. \n134 Y. Hara, Tea catechins and their applicat ions as supplements  and pharmaceutics, Pharmacol. Res. , \n2011, 64, 100–104. Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 16 \n 135 R. Hursel, W. Viechtbauer and A. G. Dulloo, The e ffects of  catechin rich teas and ca ffeine on energy \nexpenditure and  fat oxidation: a meta -analysis, Obes. Rev. , 2011, 12, 573–658. \n136 X. Tzounis, J. Vulevic, G. G. Kuhnl, T. George, J. Leonczak,  G. R. Gibson, C. Kwik -Uribe and J. P. \nSpencer, Flavanol  monomer -induced changes to the human faecal microflora,  Br. J. Nutr. , 2008, 99, 782–\n792. \n137 L. Feng, X. Gwee and E. H. Kua, Cognit ive function and  tea consumption in community dwelling \nolder Chinese in  Singapore, J. Nutr., Health Aging , 2010, 14, 433–448. \n138 M. Salahinejad and F. Aflaki, Toxic and Essential Mineral  Elements Content of Black Tea Leaves and \nTheir Tea  Infusions Consume d in Iran, Biol. Trace Elem. Res. , 2010,  134, 109–117. \n139 M. M. Özcan, A. Ünver, T. Uçar and D. Arslan, Mineral  content of some herbs and herbal teas by \ninfusion and  decoction, Food Chem. , 2008, 106, 1120 –1127.  \n140 J. S. McKenzie, J. M. Jurado and F. De P ablos,  Characterisation of tea leaves according to their total  \nmineral content by means of probabilistic neural networks,  Food Chem. , 2010, 123, 859–864. \n141 D. L. McKay and J. B. Blumberg, The role of tea in hum an health: an update, J. Am. Coll. Nutr. , 2002, \n21, 1–13. \n  Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 17 \n Table 1.  Mineral content in green and white tea leaves . \nElement  Tea Country  Concentration \n(mg/Kg)  Reference  \nChrom ium Green tea  China, Japan  0.45-0.49 118 \n Green tea  China, Japan  0.24-0.29 85 \nCopper  Green tea  China, Japan  31.5-32.3 118 \n Green tea  India, Japan  23.1-36.5 119 \n White tea  India, China, Indonesia  17.6-31.6 119 \n Green tea  China, Japan  11-26 120 \n White tea  China, Japan  10-26 120 \nFluor ine Green tea  China  217-344 121 \n Green tea  \nGreen tea  \nWhite tea  China  \nChina  49-104 \n8-626 \n3-228 122 \n123 \n18 \nManganese  Green tea  China  160-1500 123 \n Green tea  \nWhite tea  \nGreen tea  Turkey  \n \nIndia, Japan  535-2086 \n903-1026 \n211-1045 15 \n15 \n119 \n White tea  India, China, Indonesia  293-479 119 \n White tea  China, Japan  337-1463 120 \n Green tea  \nGreen tea  China, Japan  \nChina, India, Japan, Indonesia  385-2081 \n390-1260 120 \n17 \n \n \n  Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 18 \n Table 2.  Mineral content in green and white tea infusions . \nElement  Tea Country  Concentration ( µg/L) Reference  \nChrom ium Green tea1  China, India, Indonesia, Japan  nd2– 6.91  124 \nCopper  Green tea3  China  29-61  124 \n Green tea4  China  40-70  125 \n Green tea1  \n \n \nGreen tea5 \nWhite tea5 China, Sri Lanka, India, Indonesia, Japan, Tailandia  \nTurkey  \n 40-240 \n \n \n3-285 \n119-290 126  \n \n15 \n Green  tea6  China, Sri Lanka, India, Kenya, Turkey  33-191 15 \nFluor ine  Green tea7  China  1650-1830 121 \n Green tea3 China, Japan, Java, Sri Lanka, Vietnam  590-2520 \n 127  \n \nManganese  Green tea6 \nGreen tea5 \nWhite tea5 India, Japan  \nTurkey  \n 205-1009 \n780-3890 \n227-499 119 \n15 \n15 \n1 2 g of tea / 50 mL of boiling double -distilled water. Infusion time: 15 minutes.  \n2 nd: not detectable.  \n3 2 g of tea / 200 mL of boiling distilled water. Infusion time: 5 minutes.  \n4 2.5 g of tea / 236 mL of boiling water. Infusion time: 3 -6 minutes.  \n5 1 g of tea / 50 mL of boiling distilled water. Infusion time: 5 minutes.  \n6 1 g of tea / 50 mL of boiling distilled water. Infusion time: 5 minutes.  \n7 3 g of tea / 150 mL of boiling de ionized distilled water. Infusion time: 4 minutes.  \n \n  Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 19 \n Table 3 . Main effect of EGCG and the other catechins presents in green tea y white tea described in the most \nrecent literature.  \nEffect  Reference  \nAntioxidant activity  \n   Potent antioxidant  \n   High anti -free radical activity  \n   Prevention of oxidative damage in healthy cells  \n   Protection of neurons against oxidative damage  \n   Reduction of  toxicity generated by H 2O2     \n   Activation of Nrf2 factor  \n   Metal chelating activity  75 \n69 \n128  \n104 \n3 \n \n \nAntiangiogenic activity  69 \nChemopreventive and anticancer effects  \n   Inhibition of cell proliferation (damaged cells)  \n   Promotion of healthy cell growth  \n   Induction of cell apoptosis  \n   Suppression of oncogenic transcription factors  \n   Inhibitory effects at metastatic level  \n   Inhibition of TNFα expression  129 \n110 \n69 \n19 \n65 \n130 \nInduction and inhibition of enzymes  \n   Inhibition of the activity of the chromosomal enzyme telomerase  \n   Inhibition of some protein kinases  \n   Induction/inhib ition of enzymes involved in   \n   drugs  metabolism  \n   Inhibition of DNA methylation  \n   Effect on RNA expression  39 \n69 \n65 \n60 \n \n \nAnti-inflammatory activity   19, 69 \nDetoxifying effect  12, 39 \nActivity related to lipemia  \n   Reduction of intestinal absorption of lipids  \n   Promotion of fecal cholesterol excretion  \n   Inhibition of hepatic enzymes involved in   \n   cholesterol synthesis  131 \n19 \n72 \n73  \nEffects against obesity and metabolic syndrome  \n   Decrease of proliferation and differentiation of  \n   adipocytes  \n   Promotion of lipogenesis  \n   Loss of weight  \n   Promotion of leptin release  \n   Increment of β-oxidation and thermogenesis  132 \n \n133 \n19 \n134 \n102 \n97, 98, 109 \nAntidiabetic activity  \n   Improvement of insulin response  \n   Activation of the insulin signaling pathway  \nAntimicrobial activity   \n8 \n81 \n83, 104, 106, 135 \nAntiviral activity  \nAnti-osteoporosis activity  \nAnti-allergenic activity  84, 86, 87 \n107 \n10, 39 \nAntiestrogenic activity  10, 110 \nPhotoprotective activity  \nAnticariogenic activity  \nPrebiotic effect against Bifidobacterium  93, 94 \n89 \n82, 136, 137 \nNeuroprotective effect  \nAnxiolytic effect  55, 12, 115, 128 \n50, 115 \n  Pastoriza et al. / Food & Function 8 (2017) 2650-2662        pag. 20 \n Table 4 . Total antioxidant capacity of green tea compared to other foods (USDA, 2010) .45 \nFresh product  ORAC  \nμmol TE1/100 g  \nGren tea (infusion)2 1253 \nApple (different varieties)  2573-4275 \nApricot  1115 \nRed grape  1746 \nKiwi 862 \nRaspberries  5347 \nOranges (navels variety)  1819 \nAnanas  385 \n1 TE: Trolox equivalent  \n2 Infusion time: 3 minutes   "
}