{
    "filename": "Microsoft-Cloud-for-Nonprofit-Overview.pdf",
    "type": "pdf",
    "title": "One organization. One mission\n. One platform.",
    "authors": "Microsoft",
    "lastmodifiedtime": "D:20231115094734+05'30'",
    "text": "One organization.\nOne mission.  \nOne platform. \nMicrosoft Cloud for Nonprofit   \nYou are on a mission to create lasting change. To do so, your organization needs a secure, digital foundation to help unify \ndata, connect teams, automate processes and give you the right insights. And, with those tools, you can better demonstrate \nimpact to your donors, funders, and community. Not sure where to start? We are here to help.\nMicrosoft has partnered with nonprofits for over 40 years to ensure they have relevant and affordable technology. T oday, \nMicrosoft Cloud for Nonprofit brings the best of Microsoft together with solutions built for and with the nonprofit sector. \nOur solutions help connect teams across your organization, unify reports and data, and enable program participants, donors, and experiences that surpass expectations. Infused with responsible AI, Microsoft Cloud for Nonprofit can build your capacity, so you have more time to engage with your community.\nOver 325,000 nonprofits choose Microsoft technology including Cloud for Nonprofit to:\nAttract, retain, and grow donors with\n• Fundraising and Engagement on Dynamics 365 Sales \nEnterprise which includes AI-driven capabilities such as:  \n –Microsoft Sales Copilot\n –Likelihood to donate model\n• Fundraising Performance Dashboard on Power BI\nReach and engage audiences through\n• Constituent marketing journeys on Dynamics 365 Customer Insights\nDeliver programs in time at scale utilizing\n• Program impact dashboard on Power BI\n• Community Training on Azure\n• Volunteer Management  technology:\n –Volunteer Management & Engagement on  \nPower Apps\n –Volunteer center on SharePoint\n –Manage volunteers on Teams\nSecure donor and program participant data\n• Security Program for NonprofitsAttract, retain, and grow donors\nDeliver programs in time at scaleReach and engage audiencesSecure donor \n& program \np\narticipant dataWith unified data, nonprofits work smarter by raising more revenue, effectively delivering more \nprograms and services to communities , and more easily measuring the impact they’re making. \nOur ambition is to make it easier, faster, and less expensive for nonprofits to adopt technology \nsolutions so they can focus on what’s important – their mission. \nAttract, retain, and grow donors\nFundraising \nand \nEngagement   \nFundraising and Engagement  is a constituent \nrelationship management (CRM) platform \nthat modernizes donor and constituent \nengagement to help organizations increase \ntheir mission impact. By standardizing data across disparate systems, teams get a holistic \nview of constituents,  donors,  volunteers,  and \nprograms.  Its donation and transaction \nmanagement and payment gateway integrations with many solutions, including Stripe, iATS, and Moneris and more, resulting in more seamless financial reconciliation and \nreporting.  \nBuilt on Dynamics 365 Sales, Fundraising  \nand Engagement is part of a purpose-built,  \nend-to-end CRM platform that powers prospect and moves management, marketing planning and execution, and business intelligence, and enables nonprofits to drive \ngreater transparency and collaboration.  It \naligns constituent management, insights, and reporting with program delivery, finance, and \noperations data.  Fundraising and Engagement includes:  \n• Constituent  and household  management  \n• Opportunity management  \n• Donation management  \n• Designation management  \n• Donor stewardship  \n• Campaign, appeal, package,  \nand marketing list management  \n• Recurring gift management  \n• Payment processing  \n• Likelihood to donate model  \n(AI-enabled; full description below)\n• Event management   \n• Constituent research powered by LinkedIn  \nSales Navigator  \n• Unified constituent profiles across Volunteer Management, Volunteer Engagement, and Dynamics 365 Marketing\n• Reporting via views and embedded Power \nBI templates, including Fundraising Performance \nDashboard (full description below)\n• Transaction processing powered by Azure  \nLikelihood to \ndonate\n(Part of  \nFundraising and \nEngagement)   \nBuilt into Fundraising and Engagement, \nthe Likelihood to donate model is an AI \nmodel that uses your data to assign a likelihood status to each of your contacts that \nrepresents their propensity  to give. These \nstatus designations enable forward-looking segmentation to support marketing journeys \nthat help you reach your  fundraising campaign \ngoals. Theses donor statuses can be exported \nto various nonprofit  marketing solutions, \nincluding seamless integration with Dynamics \n365 Customer Insights. The model also \nprovides insights into what drives a particular contact’s likelihood status, and the ability to sort and filter on the attributes of your choice.Likelihood to donate includes:  \n• Calculated donor likelihood scores\n• Donor insights contributing to likelihood status\n• Customizable fields and donor categories\n• Connection to segmentation building with Dynamics 365 Customer Insights\nFundraising \nperformance \ndashboar\nd\n(Part of  \nFundraising and \nEngagement)\nThe Fundraising performance dashboard \nextends the analytics capabilities of  \nFundraising and Engagement, enabling you to see key fundraising performance indicators in one place. It provides a holistic view of donors, fundraising, and campaign outcomes in near-real-time as data gets added and updated in your CRM. Built on Power BI’s industry-leading data visualization platform, the dashboard connects seamlessly to your data through the Nonprofit Common Data Model.Fundraising dashboard includes:  \n• Instantly calculated and updated KPI trackers\n• Donor and campaign metrics\n• Pre-built data model connected to Fundraising and Engagement\n• Easy customization through Power BIReach and engage audiences\nConstituent  \nmarketing  \njourneys  \nConstituent marketing journeys, built on \nDynamics 365 Customer Insights, enable nonprofit marketing teams to personalize their outreach to donors and volunteers based on their history and interactions with your \norganization.  Constituent  marketing  journeys  include:   \n• Pre-built campaign and marketing segments for a variety of givers including new donors, lapsed donors, and donors who have never given a recurring gift\n• Pre-built segments for volunteers based on participation history, preferences, and qualifications including new and lapsed volunteers\n• Real-time customer journeys that automate and personalize outreach to donors and volunteers alike, including a donor welcome series and a volunteer welcome series\n• Real-time email templates to quickly and easily engage donors and volunteers including thank you emails, newsletters, and a recurring gift ask\nDeliver programs in time at scale\nVolunteer \nManagement  \nVolunteer Management is a Power App that helps nonprofit staff more efficiently manage day-to-day operations to recruit, onboard, and retain larger pools of volunteers. This technology enables volunteer managers to move from spreadsheets, documents, and systems built for donors and program participants to solutions designed for volunteers.Volunteer Management includes:    \n• Engagement opportunity management \n• Volunteer profile and history \n• Qualifications and requirements \n• Volunteer application and attendance tracking \n• Scheduling \n• Messaging and communication \n• Task and activity tracking \n• Dashboards \n• Group management \nVolunteer \nEngagement  \nVolunteer Engagement helps organizations \nengage and retain more volunteers by making it easier for volunteers to find and apply for engagement opportunities that match their skills, interests, and schedules. Built on Microsoft Power P\nages, this public-facing web \nportal interfaces with the nonprofit’s external-facing website and Volunteer Management to facilitate the flow of information between volunteers and volunteer managers. Volunteer Engagement includes:  \n• Engagement opportunity  search  \n• Volunteer profile  \n• Scheduling  \n• Engagement summary  \nVolunteer \ncenter\nThe Volunteer center SharePoint template can save volunteer managers time and improve the onboarding process for \nvolunteers by providing \na central hub of key information. Built on the familiar Microsoft 365 platform, nonprofits can share information and resources with volunteers for training, onboarding, upcoming events, and other important materials, enabling volunteers to better understand and engage with your organization. Volunteer  center  includes:  \n• Quick  links for volunteers to access key sites and \nresources both within and outside SharePoint  \n• Access to training and onboarding materials  with \nlinks to SharePoint  files and external  sites \n• Newsfeed for surfacing announcements, event updates, and other important information\n• Yammer connector for building volunteer community\n• About  us pages for volunteers to learn about \nnonprofit and volunteer staff\nManage  \nvolunteers  \nThe Manage volunteers Teams template can increase productivity and collaboration for staff that work with volunteers by streamlining volunteer management activities. This Teams template integrates with V\nolunteer \nManagement and enables staff to manage documents and execute tasks in their application of choice, across multiple devices. With the Manage volunteers Teams template \nteams can use different channels to:  \n• Share  volunteer  and engagement \nopportunity  information  with co-workers   \n• Organize and share onboarding and frequently \nused documents  \n• Make important team and event announcements  Program \nimpact  \ndashboard  \nThe Program impact dashboard helps nonprofit \nfundraisers and program managers understand the impact of funds raised, programs delivered, and outcomes achieved. It enables \nnonprofit staff to measure the results  of their \norganization’s impact  so they can  report to \nfunders, apply for grants, and  make informed, \ndata-driven decisions.  \nThis Power BI template interrelates fundraising and program data in new and transformative ways to simplify reporting on program goals, outcomes, and impact.The Program impact dashboard enables \nnonprofit  teams to:     \n• Streamline the preparation of external reports \nwith overall summary numbers  \n• Compare metrics across all programs  including \nfunding, budgets, and  people  served  \n• Track performance over time with a view of outcomes by month, year, and year-to-date\n• Track progress to key program objectives  \nand results\n• Break down silos between fundraising and \nprogram  priorities by  reporting on a donor’s \nprogram impact\nCommunity \nTraining\nCommunity Training is a customizable, mobile-optimized skilling platform. This skill-as-you-go PaaS offering can be used by nonprofits and community programs to empower staff and volunteers while offering support to deliver education, health, or volunteer servicesin the field. This Azure-based solution offers the ability to organize learning paths, assessments, and structured learning utilizing your organizational content.Community Training includes:   \n• Customizable platform settings\n• Low bandwidth learning\n• Intuitive visual interface\n• User management\n• Content management\n• Course administration \n• Certificate of completion\n• Reporting, monitoring, and analytics tools\nSecure donor and program participant data\nMicrosoft’s Security Program for Nonprofits was created to help organizations strengthen their security posture and reduce the risk of cyberthreats.This comprehensive set of offerings enables nonprofits to assess organizational risk, provide proactive monitoring and notification, and train staff on security strategies. For more information, visit our Security Program for Nonprofits page .\nSupport and training for Microsoft Cloud for Nonprofit\nMicrosoft Partners\nPartners and ready to help you evaluate, implement, and support your usage of these solutions.\nFree training\nSpecialized learning paths on Microsoft Learn provide fundraising and program delivery teams with the basics of how to use select Microsoft Cloud for Nonprofit capabilities.  Technical supportAccess free self-help tools and customer support.\nContact us to learn about nonprofit \noffers for your organization\nVisit Microsoft.com/nonprofits \nSubmit an inquiry at aka.ms/nonprofits.contactFollow us\nLinkedin/MicrosoftforNonprofits\n@msftnonprofits\nfacebook.com/msftnonprofits\nMicrosoft Tech for Social Impact  |  microsoft.com/nonprofits"
}